rksdna/swamp-v2/ch32v003_registers.h
/*
 * CH32V003 peripheral registers
 * Copyright (c) 2023 rksdna
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#ifndef CH32V003_REGISTERS_H
#define CH32V003_REGISTERS_H

#include "ch32v003_types.h"

#define FLASH_ORIGIN ((u32_t)0x08000000)
#define FLASH_SIZE ((u32_t)0x00004000)

#define SRAM_ORIGIN ((u32_t)0x20000000)
#define SRAM_SIZE ((u32_t)0x00000800)

struct ch32v003_pfic
{
    volatile u32_t ISR[8];
    volatile u32_t IPR[8];
    volatile u32_t ITHRESDR;
    volatile u32_t RESERVED;
    volatile u32_t CFGR;
    volatile u32_t GISR;
    volatile u8_t VTFIDR[4];
    u8_t RESERVED0[12];
    volatile u32_t VTFADDR[4];
    u8_t RESERVED1[0x90];
    volatile u32_t IENR[8];
    u8_t RESERVED2[0x60];
    volatile u32_t IRER[8];
    u8_t RESERVED3[0x60];
    volatile u32_t IPSR[8];
    u8_t RESERVED4[0x60];
    volatile u32_t IPRR[8];
    u8_t RESERVED5[0x60];
    volatile u32_t IACTR[8];
    u8_t RESERVED6[0xE0];
    volatile u8_t IPRIOR[256];
    u8_t RESERVED7[0x810];
    volatile u32_t SCTLR;
};

#define PFIC ((struct ch32v003_pfic*)0xE000E000)
#define PFIC_KEY1 ((u32_t)0xFA050000)
#define	PFIC_KEY2 ((u32_t)0xBCAF0000)
#define	PFIC_KEY3 ((u32_t)0xBEEF0000)

#define PFIC_SCTRL_SYSRESET ((u32_t)0x80000000)

struct ch32v003_stk
{
    volatile u32_t CTLR;
    volatile u32_t SR;
    volatile u32_t CNT;
    u32_t RESERVED0;
    volatile u32_t CMP;
    u32_t RESERVED1;
};

#define STK ((struct ch32v003_stk*) 0xE000F000)

#define STK_CTLR_STE ((u32_t)0x00000001)
#define STK_CTLR_STIE ((u32_t)0x00000002)
#define STK_CTLR_STCLK ((u32_t)0x00000004)
#define STK_CTLR_STRE ((u32_t)0x00000008)
#define STK_CTLR_SWIE ((u32_t)0x80000000)

#define STK_SR_CNTIF ((u32_t)0x00000001)

struct ch32v003_adc
{
    volatile u32_t STATR;
    volatile u32_t CTLR1;
    volatile u32_t CTLR2;
    volatile u32_t SAMPTR1;
    volatile u32_t SAMPTR2;
    volatile u32_t IOFR1;
    volatile u32_t IOFR2;
    volatile u32_t IOFR3;
    volatile u32_t IOFR4;
    volatile u32_t WDHTR;
    volatile u32_t WDLTR;
    volatile u32_t RSQR1;
    volatile u32_t RSQR2;
    volatile u32_t RSQR3;
    volatile u32_t ISQR;
    volatile u32_t IDATAR1;
    volatile u32_t IDATAR2;
    volatile u32_t IDATAR3;
    volatile u32_t IDATAR4;
    volatile u32_t RDATAR;
    volatile u32_t DLYR;
};

#define ADC1 ((struct ch32v003_adc*)0x40012400)

#define ADC_STATR_AWD ((u8_t)0x01)
#define ADC_STATR_EOC ((u8_t)0x02)
#define ADC_STATR_JEOC ((u8_t)0x04)
#define ADC_STATR_JSTRT ((u8_t)0x08)
#define ADC_STATR_STRT ((u8_t)0x10)

#define ADC_CTLR1_AWDCH ((u32_t)0x0000001F)
#define ADC_CTLR1_AWDCH_0 ((u32_t)0x00000001)
#define ADC_CTLR1_AWDCH_1 ((u32_t)0x00000002)
#define ADC_CTLR1_AWDCH_2 ((u32_t)0x00000004)
#define ADC_CTLR1_AWDCH_3 ((u32_t)0x00000008)
#define ADC_CTLR1_AWDCH_4 ((u32_t)0x00000010)
#define ADC_CTLR1_EOCIE ((u32_t)0x00000020)
#define ADC_CTLR1_AWDIE ((u32_t)0x00000040)
#define ADC_CTLR1_JEOCIE ((u32_t)0x00000080)
#define ADC_CTLR1_SCAN ((u32_t)0x00000100)
#define ADC_CTLR1_AWDSGL ((u32_t)0x00000200)
#define ADC_CTLR1_JAUTO ((u32_t)0x00000400)
#define ADC_CTLR1_DISCEN ((u32_t)0x00000800)
#define ADC_CTLR1_JDISCEN ((u32_t)0x00001000)
#define ADC_CTLR1_DISCNUM ((u32_t)0x0000E000)
#define ADC_CTLR1_DISCNUM_0 ((u32_t)0x00002000)
#define ADC_CTLR1_DISCNUM_1 ((u32_t)0x00004000)
#define ADC_CTLR1_DISCNUM_2 ((u32_t)0x00008000)
#define ADC_CTLR1_DUALMOD ((u32_t)0x000F0000)
#define ADC_CTLR1_DUALMOD_0 ((u32_t)0x00010000)
#define ADC_CTLR1_DUALMOD_1 ((u32_t)0x00020000)
#define ADC_CTLR1_DUALMOD_2 ((u32_t)0x00040000)
#define ADC_CTLR1_DUALMOD_3 ((u32_t)0x00080000)
#define ADC_CTLR1_JAWDEN ((u32_t)0x00400000)
#define ADC_CTLR1_AWDEN ((u32_t)0x00800000)

#define ADC_CTLR2_ADON ((u32_t)0x00000001)
#define ADC_CTLR2_CONT ((u32_t)0x00000002)
#define ADC_CTLR2_CAL ((u32_t)0x00000004)
#define ADC_CTLR2_RSTCAL ((u32_t)0x00000008)
#define ADC_CTLR2_DMA ((u32_t)0x00000100)
#define ADC_CTLR2_ALIGN ((u32_t)0x00000800)
#define ADC_CTLR2_JEXTSEL ((u32_t)0x00007000)
#define ADC_CTLR2_JEXTSEL_0 ((u32_t)0x00001000)
#define ADC_CTLR2_JEXTSEL_1 ((u32_t)0x00002000)
#define ADC_CTLR2_JEXTSEL_2 ((u32_t)0x00004000)
#define ADC_CTLR2_JEXTTRIG ((u32_t)0x00008000)
#define ADC_CTLR2_EXTSEL ((u32_t)0x000E0000)
#define ADC_CTLR2_EXTSEL_0 ((u32_t)0x00020000)
#define ADC_CTLR2_EXTSEL_1 ((u32_t)0x00040000)
#define ADC_CTLR2_EXTSEL_2 ((u32_t)0x00080000)
#define ADC_CTLR2_EXTTRIG ((u32_t)0x00100000)
#define ADC_CTLR2_JSWSTART ((u32_t)0x00200000)
#define ADC_CTLR2_SWSTART ((u32_t)0x00400000)
#define ADC_CTLR2_TSVREFE ((u32_t)0x00800000)

#define ADC_SAMPTR1_SMP10 ((u32_t)0x00000007)
#define ADC_SAMPTR1_SMP10_0 ((u32_t)0x00000001)
#define ADC_SAMPTR1_SMP10_1 ((u32_t)0x00000002)
#define ADC_SAMPTR1_SMP10_2 ((u32_t)0x00000004)
#define ADC_SAMPTR1_SMP11 ((u32_t)0x00000038)
#define ADC_SAMPTR1_SMP11_0 ((u32_t)0x00000008)
#define ADC_SAMPTR1_SMP11_1 ((u32_t)0x00000010)
#define ADC_SAMPTR1_SMP11_2 ((u32_t)0x00000020)
#define ADC_SAMPTR1_SMP12 ((u32_t)0x000001C0)
#define ADC_SAMPTR1_SMP12_0 ((u32_t)0x00000040)
#define ADC_SAMPTR1_SMP12_1 ((u32_t)0x00000080)
#define ADC_SAMPTR1_SMP12_2 ((u32_t)0x00000100)
#define ADC_SAMPTR1_SMP13 ((u32_t)0x00000E00)
#define ADC_SAMPTR1_SMP13_0 ((u32_t)0x00000200)
#define ADC_SAMPTR1_SMP13_1 ((u32_t)0x00000400)
#define ADC_SAMPTR1_SMP13_2 ((u32_t)0x00000800)
#define ADC_SAMPTR1_SMP14 ((u32_t)0x00007000)
#define ADC_SAMPTR1_SMP14_0 ((u32_t)0x00001000)
#define ADC_SAMPTR1_SMP14_1 ((u32_t)0x00002000)
#define ADC_SAMPTR1_SMP14_2 ((u32_t)0x00004000)
#define ADC_SAMPTR1_SMP15 ((u32_t)0x00038000)
#define ADC_SAMPTR1_SMP15_0 ((u32_t)0x00008000)
#define ADC_SAMPTR1_SMP15_1 ((u32_t)0x00010000)
#define ADC_SAMPTR1_SMP15_2 ((u32_t)0x00020000)
#define ADC_SAMPTR1_SMP16 ((u32_t)0x001C0000)
#define ADC_SAMPTR1_SMP16_0 ((u32_t)0x00040000)
#define ADC_SAMPTR1_SMP16_1 ((u32_t)0x00080000)
#define ADC_SAMPTR1_SMP16_2 ((u32_t)0x00100000)
#define ADC_SAMPTR1_SMP17 ((u32_t)0x00E00000)
#define ADC_SAMPTR1_SMP17_0 ((u32_t)0x00200000)
#define ADC_SAMPTR1_SMP17_1 ((u32_t)0x00400000)
#define ADC_SAMPTR1_SMP17_2 ((u32_t)0x00800000)

#define ADC_SAMPTR2_SMP0 ((u32_t)0x00000007)
#define ADC_SAMPTR2_SMP0_0 ((u32_t)0x00000001)
#define ADC_SAMPTR2_SMP0_1 ((u32_t)0x00000002)
#define ADC_SAMPTR2_SMP0_2 ((u32_t)0x00000004)
#define ADC_SAMPTR2_SMP1 ((u32_t)0x00000038)
#define ADC_SAMPTR2_SMP1_0 ((u32_t)0x00000008)
#define ADC_SAMPTR2_SMP1_1 ((u32_t)0x00000010)
#define ADC_SAMPTR2_SMP1_2 ((u32_t)0x00000020)
#define ADC_SAMPTR2_SMP2 ((u32_t)0x000001C0)
#define ADC_SAMPTR2_SMP2_0 ((u32_t)0x00000040)
#define ADC_SAMPTR2_SMP2_1 ((u32_t)0x00000080)
#define ADC_SAMPTR2_SMP2_2 ((u32_t)0x00000100)
#define ADC_SAMPTR2_SMP3 ((u32_t)0x00000E00)
#define ADC_SAMPTR2_SMP3_0 ((u32_t)0x00000200)
#define ADC_SAMPTR2_SMP3_1 ((u32_t)0x00000400)
#define ADC_SAMPTR2_SMP3_2 ((u32_t)0x00000800)
#define ADC_SAMPTR2_SMP4 ((u32_t)0x00007000)
#define ADC_SAMPTR2_SMP4_0 ((u32_t)0x00001000)
#define ADC_SAMPTR2_SMP4_1 ((u32_t)0x00002000)
#define ADC_SAMPTR2_SMP4_2 ((u32_t)0x00004000)
#define ADC_SAMPTR2_SMP5 ((u32_t)0x00038000)
#define ADC_SAMPTR2_SMP5_0 ((u32_t)0x00008000)
#define ADC_SAMPTR2_SMP5_1 ((u32_t)0x00010000)
#define ADC_SAMPTR2_SMP5_2 ((u32_t)0x00020000)
#define ADC_SAMPTR2_SMP6 ((u32_t)0x001C0000)
#define ADC_SAMPTR2_SMP6_0 ((u32_t)0x00040000)
#define ADC_SAMPTR2_SMP6_1 ((u32_t)0x00080000)
#define ADC_SAMPTR2_SMP6_2 ((u32_t)0x00100000)
#define ADC_SAMPTR2_SMP7 ((u32_t)0x00E00000)
#define ADC_SAMPTR2_SMP7_0 ((u32_t)0x00200000)
#define ADC_SAMPTR2_SMP7_1 ((u32_t)0x00400000)
#define ADC_SAMPTR2_SMP7_2 ((u32_t)0x00800000)
#define ADC_SAMPTR2_SMP8 ((u32_t)0x07000000)
#define ADC_SAMPTR2_SMP8_0 ((u32_t)0x01000000)
#define ADC_SAMPTR2_SMP8_1 ((u32_t)0x02000000)
#define ADC_SAMPTR2_SMP8_2 ((u32_t)0x04000000)
#define ADC_SAMPTR2_SMP9 ((u32_t)0x38000000)
#define ADC_SAMPTR2_SMP9_0 ((u32_t)0x08000000)
#define ADC_SAMPTR2_SMP9_1 ((u32_t)0x10000000)
#define ADC_SAMPTR2_SMP9_2 ((u32_t)0x20000000)

