rksdna/swamp-v2/ch32v003_registers.h
#define ADC_IOFR1_JOFFSET1 ((u16_t)0x0FFF)

#define ADC_IOFR2_JOFFSET2 ((u16_t)0x0FFF)

#define ADC_IOFR3_JOFFSET3 ((u16_t)0x0FFF)

#define ADC_IOFR4_JOFFSET4 ((u16_t)0x0FFF)

#define ADC_WDHTR_HT ((u16_t)0x0FFF)

#define ADC_WDLTR _LT ((u16_t)0x0FFF)

#define ADC_RSQR1_SQ13 ((u32_t)0x0000001F)
#define ADC_RSQR1_SQ13_0 ((u32_t)0x00000001)
#define ADC_RSQR1_SQ13_1 ((u32_t)0x00000002)
#define ADC_RSQR1_SQ13_2 ((u32_t)0x00000004)
#define ADC_RSQR1_SQ13_3 ((u32_t)0x00000008)
#define ADC_RSQR1_SQ13_4 ((u32_t)0x00000010)
#define ADC_RSQR1_SQ14 ((u32_t)0x000003E0)
#define ADC_RSQR1_SQ14_0 ((u32_t)0x00000020)
#define ADC_RSQR1_SQ14_1 ((u32_t)0x00000040)
#define ADC_RSQR1_SQ14_2 ((u32_t)0x00000080)
#define ADC_RSQR1_SQ14_3 ((u32_t)0x00000100)
#define ADC_RSQR1_SQ14_4 ((u32_t)0x00000200)
#define ADC_RSQR1_SQ15 ((u32_t)0x00007C00)
#define ADC_RSQR1_SQ15_0 ((u32_t)0x00000400)
#define ADC_RSQR1_SQ15_1 ((u32_t)0x00000800)
#define ADC_RSQR1_SQ15_2 ((u32_t)0x00001000)
#define ADC_RSQR1_SQ15_3 ((u32_t)0x00002000)
#define ADC_RSQR1_SQ15_4 ((u32_t)0x00004000)
#define ADC_RSQR1_SQ16 ((u32_t)0x000F8000)
#define ADC_RSQR1_SQ16_0 ((u32_t)0x00008000)
#define ADC_RSQR1_SQ16_1 ((u32_t)0x00010000)
#define ADC_RSQR1_SQ16_2 ((u32_t)0x00020000)
#define ADC_RSQR1_SQ16_3 ((u32_t)0x00040000)
#define ADC_RSQR1_SQ16_4 ((u32_t)0x00080000)
#define ADC_RSQR1_L ((u32_t)0x00F00000)
#define ADC_RSQR1_L_0 ((u32_t)0x00100000)
#define ADC_RSQR1_L_1 ((u32_t)0x00200000)
#define ADC_RSQR1_L_2 ((u32_t)0x00400000)
#define ADC_RSQR1_L_3 ((u32_t)0x00800000)

#define ADC_RSQR2_SQ7 ((u32_t)0x0000001F)
#define ADC_RSQR2_SQ7_0 ((u32_t)0x00000001)
#define ADC_RSQR2_SQ7_1 ((u32_t)0x00000002)
#define ADC_RSQR2_SQ7_2 ((u32_t)0x00000004)
#define ADC_RSQR2_SQ7_3 ((u32_t)0x00000008)
#define ADC_RSQR2_SQ7_4 ((u32_t)0x00000010)
#define ADC_RSQR2_SQ8 ((u32_t)0x000003E0)
#define ADC_RSQR2_SQ8_0 ((u32_t)0x00000020)
#define ADC_RSQR2_SQ8_1 ((u32_t)0x00000040)
#define ADC_RSQR2_SQ8_2 ((u32_t)0x00000080)
#define ADC_RSQR2_SQ8_3 ((u32_t)0x00000100)
#define ADC_RSQR2_SQ8_4 ((u32_t)0x00000200)
#define ADC_RSQR2_SQ9 ((u32_t)0x00007C00)
#define ADC_RSQR2_SQ9_0 ((u32_t)0x00000400)
#define ADC_RSQR2_SQ9_1 ((u32_t)0x00000800)
#define ADC_RSQR2_SQ9_2 ((u32_t)0x00001000)
#define ADC_RSQR2_SQ9_3 ((u32_t)0x00002000)
#define ADC_RSQR2_SQ9_4 ((u32_t)0x00004000)
#define ADC_RSQR2_SQ10 ((u32_t)0x000F8000)
#define ADC_RSQR2_SQ10_0 ((u32_t)0x00008000)
#define ADC_RSQR2_SQ10_1 ((u32_t)0x00010000)
#define ADC_RSQR2_SQ10_2 ((u32_t)0x00020000)
#define ADC_RSQR2_SQ10_3 ((u32_t)0x00040000)
#define ADC_RSQR2_SQ10_4 ((u32_t)0x00080000)
#define ADC_RSQR2_SQ11 ((u32_t)0x01F00000)
#define ADC_RSQR2_SQ11_0 ((u32_t)0x00100000)
#define ADC_RSQR2_SQ11_1 ((u32_t)0x00200000)
#define ADC_RSQR2_SQ11_2 ((u32_t)0x00400000)
#define ADC_RSQR2_SQ11_3 ((u32_t)0x00800000)
#define ADC_RSQR2_SQ11_4 ((u32_t)0x01000000)
#define ADC_RSQR2_SQ12 ((u32_t)0x3E000000)
#define ADC_RSQR2_SQ12_0 ((u32_t)0x02000000)
#define ADC_RSQR2_SQ12_1 ((u32_t)0x04000000)
#define ADC_RSQR2_SQ12_2 ((u32_t)0x08000000)
#define ADC_RSQR2_SQ12_3 ((u32_t)0x10000000)
#define ADC_RSQR2_SQ12_4 ((u32_t)0x20000000)

#define ADC_RSQR3_SQ1 ((u32_t)0x0000001F)
#define ADC_RSQR3_SQ1_0 ((u32_t)0x00000001)
#define ADC_RSQR3_SQ1_1 ((u32_t)0x00000002)
#define ADC_RSQR3_SQ1_2 ((u32_t)0x00000004)
#define ADC_RSQR3_SQ1_3 ((u32_t)0x00000008)
#define ADC_RSQR3_SQ1_4 ((u32_t)0x00000010)
#define ADC_RSQR3_SQ2 ((u32_t)0x000003E0)
#define ADC_RSQR3_SQ2_0 ((u32_t)0x00000020)
#define ADC_RSQR3_SQ2_1 ((u32_t)0x00000040)
#define ADC_RSQR3_SQ2_2 ((u32_t)0x00000080)
#define ADC_RSQR3_SQ2_3 ((u32_t)0x00000100)
#define ADC_RSQR3_SQ2_4 ((u32_t)0x00000200)
#define ADC_RSQR3_SQ3 ((u32_t)0x00007C00)
#define ADC_RSQR3_SQ3_0 ((u32_t)0x00000400)
#define ADC_RSQR3_SQ3_1 ((u32_t)0x00000800)
#define ADC_RSQR3_SQ3_2 ((u32_t)0x00001000)
#define ADC_RSQR3_SQ3_3 ((u32_t)0x00002000)
#define ADC_RSQR3_SQ3_4 ((u32_t)0x00004000)
#define ADC_RSQR3_SQ4 ((u32_t)0x000F8000)
#define ADC_RSQR3_SQ4_0 ((u32_t)0x00008000)
#define ADC_RSQR3_SQ4_1 ((u32_t)0x00010000)
#define ADC_RSQR3_SQ4_2 ((u32_t)0x00020000)
#define ADC_RSQR3_SQ4_3 ((u32_t)0x00040000)
#define ADC_RSQR3_SQ4_4 ((u32_t)0x00080000)
#define ADC_RSQR3_SQ5 ((u32_t)0x01F00000)
#define ADC_RSQR3_SQ5_0 ((u32_t)0x00100000)
#define ADC_RSQR3_SQ5_1 ((u32_t)0x00200000)
#define ADC_RSQR3_SQ5_2 ((u32_t)0x00400000)
#define ADC_RSQR3_SQ5_3 ((u32_t)0x00800000)
#define ADC_RSQR3_SQ5_4 ((u32_t)0x01000000)
#define ADC_RSQR3_SQ6 ((u32_t)0x3E000000)
#define ADC_RSQR3_SQ6_0 ((u32_t)0x02000000)
#define ADC_RSQR3_SQ6_1 ((u32_t)0x04000000)
#define ADC_RSQR3_SQ6_2 ((u32_t)0x08000000)
#define ADC_RSQR3_SQ6_3 ((u32_t)0x10000000)
#define ADC_RSQR3_SQ6_4 ((u32_t)0x20000000)

#define ADC_ISQR_JSQ1 ((u32_t)0x0000001F)
#define ADC_ISQR_JSQ1_0 ((u32_t)0x00000001)
#define ADC_ISQR_JSQ1_1 ((u32_t)0x00000002)
#define ADC_ISQR_JSQ1_2 ((u32_t)0x00000004)
#define ADC_ISQR_JSQ1_3 ((u32_t)0x00000008)
#define ADC_ISQR_JSQ1_4 ((u32_t)0x00000010)
#define ADC_ISQR_JSQ2 ((u32_t)0x000003E0)
#define ADC_ISQR_JSQ2_0 ((u32_t)0x00000020)
#define ADC_ISQR_JSQ2_1 ((u32_t)0x00000040)
#define ADC_ISQR_JSQ2_2 ((u32_t)0x00000080)
#define ADC_ISQR_JSQ2_3 ((u32_t)0x00000100)
#define ADC_ISQR_JSQ2_4 ((u32_t)0x00000200)
#define ADC_ISQR_JSQ3 ((u32_t)0x00007C00)
#define ADC_ISQR_JSQ3_0 ((u32_t)0x00000400)
#define ADC_ISQR_JSQ3_1 ((u32_t)0x00000800)
#define ADC_ISQR_JSQ3_2 ((u32_t)0x00001000)
#define ADC_ISQR_JSQ3_3 ((u32_t)0x00002000)
#define ADC_ISQR_JSQ3_4 ((u32_t)0x00004000)
#define ADC_ISQR_JSQ4 ((u32_t)0x000F8000)
#define ADC_ISQR_JSQ4_0 ((u32_t)0x00008000)
#define ADC_ISQR_JSQ4_1 ((u32_t)0x00010000)
#define ADC_ISQR_JSQ4_2 ((u32_t)0x00020000)
#define ADC_ISQR_JSQ4_3 ((u32_t)0x00040000)
#define ADC_ISQR_JSQ4_4 ((u32_t)0x00080000)
#define ADC_ISQR_JL ((u32_t)0x00300000)
#define ADC_ISQR_JL_0 ((u32_t)0x00100000)
#define ADC_ISQR_JL_1 ((u32_t)0x00200000)

#define ADC_IDATAR1_JDATA ((u16_t)0xFFFF)

#define ADC_IDATAR2_JDATA ((u16_t)0xFFFF)

#define ADC_IDATAR3_JDATA ((u16_t)0xFFFF)

