rksdna/swamp-v2/ch32v003_registers.h
#define ADC_IDATAR4_JDATA ((u16_t)0xFFFF)

#define ADC_RDATAR_DATA ((u32_t)0x0000FFFF)
#define ADC_RDATAR_ADC2DATA ((u32_t)0xFFFF0000)

struct ch32v003_dbgmcu
{
    volatile u32_t CFGR0;
    volatile u32_t CFGR1;
};

struct ch32v003_dma
{
    volatile u32_t INTFR;
    volatile u32_t INTFCR;
};

#define DMA1 ((struct ch32v003_dma*)0x40020000)

#define DMA_INTFR_GIF1 ((u32_t)0x00000001)
#define DMA_INTFR_TCIF1 ((u32_t)0x00000002)
#define DMA_INTFR_HTIF1 ((u32_t)0x00000004)
#define DMA_INTFR_TEIF1 ((u32_t)0x00000008)
#define DMA_INTFR_GIF2 ((u32_t)0x00000010)
#define DMA_INTFR_TCIF2 ((u32_t)0x00000020)
#define DMA_INTFR_HTIF2 ((u32_t)0x00000040)
#define DMA_INTFR_TEIF2 ((u32_t)0x00000080)
#define DMA_INTFR_GIF3 ((u32_t)0x00000100)
#define DMA_INTFR_TCIF3 ((u32_t)0x00000200)
#define DMA_INTFR_HTIF3 ((u32_t)0x00000400)
#define DMA_INTFR_TEIF3 ((u32_t)0x00000800)
#define DMA_INTFR_GIF4 ((u32_t)0x00001000)
#define DMA_INTFR_TCIF4 ((u32_t)0x00002000)
#define DMA_INTFR_HTIF4 ((u32_t)0x00004000)
#define DMA_INTFR_TEIF4 ((u32_t)0x00008000)
#define DMA_INTFR_GIF5 ((u32_t)0x00010000)
#define DMA_INTFR_TCIF5 ((u32_t)0x00020000)
#define DMA_INTFR_HTIF5 ((u32_t)0x00040000)
#define DMA_INTFR_TEIF5 ((u32_t)0x00080000)
#define DMA_INTFR_GIF6 ((u32_t)0x00100000)
#define DMA_INTFR_TCIF6 ((u32_t)0x00200000)
#define DMA_INTFR_HTIF6 ((u32_t)0x00400000)
#define DMA_INTFR_TEIF6 ((u32_t)0x00800000)
#define DMA_INTFR_GIF7 ((u32_t)0x01000000)
#define DMA_INTFR_TCIF7 ((u32_t)0x02000000)
#define DMA_INTFR_HTIF7 ((u32_t)0x04000000)
#define DMA_INTFR_TEIF7 ((u32_t)0x08000000)

#define DMA_INTFCR_CGIF1 ((u32_t)0x00000001)
#define DMA_INTFCR_CTCIF1 ((u32_t)0x00000002)
#define DMA_INTFCR_CHTIF1 ((u32_t)0x00000004)
#define DMA_INTFCR_CTEIF1 ((u32_t)0x00000008)
#define DMA_INTFCR_CGIF2 ((u32_t)0x00000010)
#define DMA_INTFCR_CTCIF2 ((u32_t)0x00000020)
#define DMA_INTFCR_CHTIF2 ((u32_t)0x00000040)
#define DMA_INTFCR_CTEIF2 ((u32_t)0x00000080)
#define DMA_INTFCR_CGIF3 ((u32_t)0x00000100)
#define DMA_INTFCR_CTCIF3 ((u32_t)0x00000200)
#define DMA_INTFCR_CHTIF3 ((u32_t)0x00000400)
#define DMA_INTFCR_CTEIF3 ((u32_t)0x00000800)
#define DMA_INTFCR_CGIF4 ((u32_t)0x00001000)
#define DMA_INTFCR_CTCIF4 ((u32_t)0x00002000)
#define DMA_INTFCR_CHTIF4 ((u32_t)0x00004000)
#define DMA_INTFCR_CTEIF4 ((u32_t)0x00008000)
#define DMA_INTFCR_CGIF5 ((u32_t)0x00010000)
#define DMA_INTFCR_CTCIF5 ((u32_t)0x00020000)
#define DMA_INTFCR_CHTIF5 ((u32_t)0x00040000)
#define DMA_INTFCR_CTEIF5 ((u32_t)0x00080000)
#define DMA_INTFCR_CGIF6 ((u32_t)0x00100000)
#define DMA_INTFCR_CTCIF6 ((u32_t)0x00200000)
#define DMA_INTFCR_CHTIF6 ((u32_t)0x00400000)
#define DMA_INTFCR_CTEIF6 ((u32_t)0x00800000)
#define DMA_INTFCR_CGIF7 ((u32_t)0x01000000)
#define DMA_INTFCR_CTCIF7 ((u32_t)0x02000000)
#define DMA_INTFCR_CHTIF7 ((u32_t)0x04000000)
#define DMA_INTFCR_CTEIF7 ((u32_t)0x08000000)

struct ch32v003_dma_channel
{
    volatile u32_t CFGR;
    volatile u32_t CNTR;
    volatile u32_t PADDR;
    volatile u32_t MADDR;
};

#define DMA1_CH1 ((struct ch32v003_dma_channel*)0x40020008)
#define DMA1_CH2 ((struct ch32v003_dma_channel*)0x4002001C)
#define DMA1_CH3 ((struct ch32v003_dma_channel*)0x40020030)
#define DMA1_CH4 ((struct ch32v003_dma_channel*)0x40020044)
#define DMA1_CH5 ((struct ch32v003_dma_channel*)0x40020058)
#define DMA1_CH6 ((struct ch32v003_dma_channel*)0x4002006C)
#define DMA1_CH7 ((struct ch32v003_dma_channel*)0x40020080)

#define DMA_CH_CFGR_EN ((u16_t)0x0001)
#define DMA_CH_CFGR_TCIE ((u16_t)0x0002)
#define DMA_CH_CFGR_HTIE ((u16_t)0x0004)
#define DMA_CH_CFGR_TEIE ((u16_t)0x0008)
#define DMA_CH_CFGR_DIR ((u16_t)0x0010)
#define DMA_CH_CFGR_CIRC ((u16_t)0x0020)
#define DMA_CH_CFGR_PINC ((u16_t)0x0040)
#define DMA_CH_CFGR_MINC ((u16_t)0x0080)
#define DMA_CH_CFGR_PSIZE ((u16_t)0x0300)
#define DMA_CH_CFGR_PSIZE_0 ((u16_t)0x0100)
#define DMA_CH_CFGR_PSIZE_1 ((u16_t)0x0200)
#define DMA_CH_CFGR_MSIZE ((u16_t)0x0C00)
#define DMA_CH_CFGR_MSIZE_0 ((u16_t)0x0400)
#define DMA_CH_CFGR_MSIZE_1 ((u16_t)0x0800)
#define DMA_CH_CFGR_PL ((u16_t)0x3000)
#define DMA_CH_CFGR_PL_0 ((u16_t)0x1000)
#define DMA_CH_CFGR_PL_1 ((u16_t)0x2000)
#define DMA_CH_CFGR_MEM2MEM ((u16_t)0x4000)

#define DMA_CH_CNTR_NDT ((u16_t)0xFFFF)

#define DMA_CH_PADDR_PA ((u32_t)0xFFFFFFFF)

#define DMA_CH_MADDR_MA ((u32_t)0xFFFFFFFF)

struct ch32v003_exti
{
    volatile u32_t INTENR;
    volatile u32_t EVENR;
    volatile u32_t RTENR;
    volatile u32_t FTENR;
    volatile u32_t SWIEVR;
    volatile u32_t INTFR;
};

#define EXTI ((struct ch32v003_exti*)0x40010400)

#define EXTI_INTENR_MR0 ((u32_t)0x00000001)
#define EXTI_INTENR_MR1 ((u32_t)0x00000002)
#define EXTI_INTENR_MR2 ((u32_t)0x00000004)
#define EXTI_INTENR_MR3 ((u32_t)0x00000008)
#define EXTI_INTENR_MR4 ((u32_t)0x00000010)
#define EXTI_INTENR_MR5 ((u32_t)0x00000020)
#define EXTI_INTENR_MR6 ((u32_t)0x00000040)
#define EXTI_INTENR_MR7 ((u32_t)0x00000080)
#define EXTI_INTENR_MR8 ((u32_t)0x00000100)
#define EXTI_INTENR_MR9 ((u32_t)0x00000200)

#define EXTI_EVENR_MR0 ((u32_t)0x00000001)
#define EXTI_EVENR_MR1 ((u32_t)0x00000002)
#define EXTI_EVENR_MR2 ((u32_t)0x00000004)
#define EXTI_EVENR_MR3 ((u32_t)0x00000008)
#define EXTI_EVENR_MR4 ((u32_t)0x00000010)
#define EXTI_EVENR_MR5 ((u32_t)0x00000020)
#define EXTI_EVENR_MR6 ((u32_t)0x00000040)
#define EXTI_EVENR_MR7 ((u32_t)0x00000080)
#define EXTI_EVENR_MR8 ((u32_t)0x00000100)
#define EXTI_EVENR_MR9 ((u32_t)0x00000200)

#define EXTI_RTENR_TR0 ((u32_t)0x00000001)
#define EXTI_RTENR_TR1 ((u32_t)0x00000002)
#define EXTI_RTENR_TR2 ((u32_t)0x00000004)
#define EXTI_RTENR_TR3 ((u32_t)0x00000008)
#define EXTI_RTENR_TR4 ((u32_t)0x00000010)
#define EXTI_RTENR_TR5 ((u32_t)0x00000020)
#define EXTI_RTENR_TR6 ((u32_t)0x00000040)
#define EXTI_RTENR_TR7 ((u32_t)0x00000080)
#define EXTI_RTENR_TR8 ((u32_t)0x00000100)
#define EXTI_RTENR_TR9 ((u32_t)0x00000200)

#define EXTI_FTENR_TR0 ((u32_t)0x00000001)
#define EXTI_FTENR_TR1 ((u32_t)0x00000002)
#define EXTI_FTENR_TR2 ((u32_t)0x00000004)
#define EXTI_FTENR_TR3 ((u32_t)0x00000008)
#define EXTI_FTENR_TR4 ((u32_t)0x00000010)
#define EXTI_FTENR_TR5 ((u32_t)0x00000020)
#define EXTI_FTENR_TR6 ((u32_t)0x00000040)
#define EXTI_FTENR_TR7 ((u32_t)0x00000080)
#define EXTI_FTENR_TR8 ((u32_t)0x00000100)
#define EXTI_FTENR_TR9 ((u32_t)0x00000200)

#define EXTI_SWIEVR_SWIEVR0 ((u32_t)0x00000001)
#define EXTI_SWIEVR_SWIEVR1 ((u32_t)0x00000002)
#define EXTI_SWIEVR_SWIEVR2 ((u32_t)0x00000004)
#define EXTI_SWIEVR_SWIEVR3 ((u32_t)0x00000008)
#define EXTI_SWIEVR_SWIEVR4 ((u32_t)0x00000010)
#define EXTI_SWIEVR_SWIEVR5 ((u32_t)0x00000020)
#define EXTI_SWIEVR_SWIEVR6 ((u32_t)0x00000040)
#define EXTI_SWIEVR_SWIEVR7 ((u32_t)0x00000080)
#define EXTI_SWIEVR_SWIEVR8 ((u32_t)0x00000100)
#define EXTI_SWIEVR_SWIEVR9 ((u32_t)0x00000200)

