rksdna/swamp-v2/ch32v003_registers.h
#define EXTI_INTF_INTF0 ((u32_t)0x00000001)
#define EXTI_INTF_INTF1 ((u32_t)0x00000002)
#define EXTI_INTF_INTF2 ((u32_t)0x00000004)
#define EXTI_INTF_INTF3 ((u32_t)0x00000008)
#define EXTI_INTF_INTF4 ((u32_t)0x00000010)
#define EXTI_INTF_INTF5 ((u32_t)0x00000020)
#define EXTI_INTF_INTF6 ((u32_t)0x00000040)
#define EXTI_INTF_INTF7 ((u32_t)0x00000080)
#define EXTI_INTF_INTF8 ((u32_t)0x00000100)
#define EXTI_INTF_INTF9 ((u32_t)0x00000200)

struct ch32v003_flash
{
    volatile u32_t ACTLR;
    volatile u32_t KEYR;
    volatile u32_t OBKEYR;
    volatile u32_t STATR;
    volatile u32_t CTLR;
    volatile u32_t ADDR;
    volatile u32_t RESERVED;
    volatile u32_t OBR;
    volatile u32_t WPR;
    volatile u32_t MODEKEYR;
    volatile u32_t BOOT_MODEKEYR;
};

#define FLASH ((struct ch32v003_flash*)0x40022000)

#define FLASH_ACTLR_LATENCY ((u8_t)0x03)
#define FLASH_ACTLR_LATENCY_0 ((u8_t)0x00)
#define FLASH_ACTLR_LATENCY_1 ((u8_t)0x01)
#define FLASH_ACTLR_LATENCY_2 ((u8_t)0x02)

#define FLASH_KEYR_FKEYR ((u32_t)0xFFFFFFFF)

#define FLASH_OBKEYR_OBKEYR ((u32_t)0xFFFFFFFF)

#define FLASH_STATR_BSY ((u8_t)0x01)
#define FLASH_STATR_WRPRTERR ((u8_t)0x10)
#define FLASH_STATR_EOP ((u8_t)0x20)

#define FLASH_CTLR_PG ((u16_t)0x0001)
#define FLASH_CTLR_PER ((u16_t)0x0002)
#define FLASH_CTLR_MER ((u16_t)0x0004)
#define FLASH_CTLR_OPTPG ((u16_t)0x0010)
#define FLASH_CTLR_OPTER ((u16_t)0x0020)
#define FLASH_CTLR_STRT ((u16_t)0x0040)
#define FLASH_CTLR_LOCK ((u16_t)0x0080)
#define FLASH_CTLR_OPTWRE ((u16_t)0x0200)
#define FLASH_CTLR_ERRIE ((u16_t)0x0400)
#define FLASH_CTLR_EOPIE ((u16_t)0x1000)
#define FLASH_CTLR_PAGE_PG ((u16_t)0x00010000)
#define FLASH_CTLR_PAGE_ER ((u16_t)0x00020000)
#define FLASH_CTLR_BUF_LOAD ((u16_t)0x00040000)
#define FLASH_CTLR_BUF_RST ((u16_t)0x00080000)

#define FLASH_ADDR_FAR ((u32_t)0xFFFFFFFF)

#define FLASH_OBR_OPTERR ((u16_t)0x0001)
#define FLASH_OBR_RDPRT ((u16_t)0x0002)

#define FLASH_OBR_USER ((u16_t)0x03FC)
#define FLASH_OBR_WDG_SW ((u16_t)0x0004)
#define FLASH_OBR_NRST_STOP ((u16_t)0x0008)
#define FLASH_OBR_NRST_STDBY ((u16_t)0x0010)
#define FLASH_OBR_RST_MODE ((u16_t)0x0060)

#define FLASH_WPR_WRP ((u32_t)0xFFFFFFFF)

struct ch32v003_ob
{
    volatile u16_t RDPR;
    volatile u16_t USER;
    volatile u16_t DATA0;
    volatile u16_t DATA1;
    volatile u16_t WRPR0;
    volatile u16_t WRPR1;
};

#define OB ((struct ch32v003_ob*)0x1FFFF800)

#define OB_RDPR_RDPR ((u32_t)0x000000FF)
#define OB_RDPR_NRDPR ((u32_t)0x0000FF00)

#define OB_USER_USER ((u32_t)0x00FF0000)
#define OB_USER_nUSER ((u32_t)0xFF000000)

#define OB_DATA0_DATA0 ((u32_t)0x000000FF)
#define OB_DATA0_NDATA0 ((u32_t)0x0000FF00)

#define OB_DATA1_DATA1 ((u32_t)0x00FF0000)
#define OB_DATA1_NDATA1 ((u32_t)0xFF000000)

#define OB_WRPR0_WRPR0 ((u32_t)0x000000FF)
#define OB_WRPR0_NWRPR0 ((u32_t)0x0000FF00)

#define OB_WRPR1_WRPR1 ((u32_t)0x00FF0000)
#define OB_WRPR1_NWRPR1 ((u32_t)0xFF000000)

struct ch32v003_gpio
{
    volatile u32_t CFGLR;
    volatile u32_t CFGHR;
    volatile u32_t INDR;
    volatile u32_t OUTDR;
    volatile u32_t BSHR;
    volatile u32_t BCR;
    volatile u32_t LCKR;
};

#define GPIOA ((struct ch32v003_gpio*)0x40010800)
#define GPIOC ((struct ch32v003_gpio*)0x40011000)
#define GPIOD ((struct ch32v003_gpio*)0x40011400)

#define GPIO_CFGLR_MODE ((u32_t)0x33333333)
#define GPIO_CFGLR_MODE0 ((u32_t)0x00000003)
#define GPIO_CFGLR_MODE0_0 ((u32_t)0x00000001)
#define GPIO_CFGLR_MODE0_1 ((u32_t)0x00000002)
#define GPIO_CFGLR_MODE1 ((u32_t)0x00000030)
#define GPIO_CFGLR_MODE1_0 ((u32_t)0x00000010)
#define GPIO_CFGLR_MODE1_1 ((u32_t)0x00000020)
#define GPIO_CFGLR_MODE2 ((u32_t)0x00000300)
#define GPIO_CFGLR_MODE2_0 ((u32_t)0x00000100)
#define GPIO_CFGLR_MODE2_1 ((u32_t)0x00000200)
#define GPIO_CFGLR_MODE3 ((u32_t)0x00003000)
#define GPIO_CFGLR_MODE3_0 ((u32_t)0x00001000)
#define GPIO_CFGLR_MODE3_1 ((u32_t)0x00002000)
#define GPIO_CFGLR_MODE4 ((u32_t)0x00030000)
#define GPIO_CFGLR_MODE4_0 ((u32_t)0x00010000)
#define GPIO_CFGLR_MODE4_1 ((u32_t)0x00020000)
#define GPIO_CFGLR_MODE5 ((u32_t)0x00300000)
#define GPIO_CFGLR_MODE5_0 ((u32_t)0x00100000)
#define GPIO_CFGLR_MODE5_1 ((u32_t)0x00200000)
#define GPIO_CFGLR_MODE6 ((u32_t)0x03000000)
#define GPIO_CFGLR_MODE6_0 ((u32_t)0x01000000)
#define GPIO_CFGLR_MODE6_1 ((u32_t)0x02000000)
#define GPIO_CFGLR_MODE7 ((u32_t)0x30000000)
#define GPIO_CFGLR_MODE7_0 ((u32_t)0x10000000)
#define GPIO_CFGLR_MODE7_1 ((u32_t)0x20000000)
#define GPIO_CFGLR_CNF ((u32_t)0xCCCCCCCC)
#define GPIO_CFGLR_CNF0 ((u32_t)0x0000000C)
#define GPIO_CFGLR_CNF0_0 ((u32_t)0x00000004)
#define GPIO_CFGLR_CNF0_1 ((u32_t)0x00000008)
#define GPIO_CFGLR_CNF1 ((u32_t)0x000000C0)
#define GPIO_CFGLR_CNF1_0 ((u32_t)0x00000040)
#define GPIO_CFGLR_CNF1_1 ((u32_t)0x00000080)
#define GPIO_CFGLR_CNF2 ((u32_t)0x00000C00)
#define GPIO_CFGLR_CNF2_0 ((u32_t)0x00000400)
#define GPIO_CFGLR_CNF2_1 ((u32_t)0x00000800)
#define GPIO_CFGLR_CNF3 ((u32_t)0x0000C000)
#define GPIO_CFGLR_CNF3_0 ((u32_t)0x00004000)
#define GPIO_CFGLR_CNF3_1 ((u32_t)0x00008000)
#define GPIO_CFGLR_CNF4 ((u32_t)0x000C0000)
#define GPIO_CFGLR_CNF4_0 ((u32_t)0x00040000)
#define GPIO_CFGLR_CNF4_1 ((u32_t)0x00080000)
#define GPIO_CFGLR_CNF5 ((u32_t)0x00C00000)
#define GPIO_CFGLR_CNF5_0 ((u32_t)0x00400000)
#define GPIO_CFGLR_CNF5_1 ((u32_t)0x00800000)
#define GPIO_CFGLR_CNF6 ((u32_t)0x0C000000)
#define GPIO_CFGLR_CNF6_0 ((u32_t)0x04000000)
#define GPIO_CFGLR_CNF6_1 ((u32_t)0x08000000)
#define GPIO_CFGLR_CNF7 ((u32_t)0xC0000000)
#define GPIO_CFGLR_CNF7_0 ((u32_t)0x40000000)
#define GPIO_CFGLR_CNF7_1 ((u32_t)0x80000000)

#define GPIO_CFGLR_GPI_AN(pin) ((u32_t)0x00000000 << (4 *(pin)))
#define GPIO_CFGLR_GPI_FL(pin) ((u32_t)0x00000004 << (4 *(pin)))
#define GPIO_CFGLR_GPI_PU(pin) ((u32_t)0x00000008 << (4 *(pin)))
#define GPIO_CFGLR_GPO_PP(pin) ((u32_t)0x00000001 << (4 *(pin)))
#define GPIO_CFGLR_GPO_PP_S(pin) ((u32_t)0x00000002 << (4 *(pin)))
#define GPIO_CFGLR_GPO_PP_F(pin) ((u32_t)0x00000003 << (4 *(pin)))
#define GPIO_CFGLR_GPO_OD(pin) ((u32_t)0x00000005 << (4 *(pin)))
#define GPIO_CFGLR_GPO_OD_S(pin) ((u32_t)0x00000006 << (4 *(pin)))
#define GPIO_CFGLR_GPO_OD_F(pin) ((u32_t)0x00000007 << (4 *(pin)))
#define GPIO_CFGLR_AFO_PP(pin) ((u32_t)0x00000009 << (4 *(pin)))
#define GPIO_CFGLR_AFO_PP_S(pin) ((u32_t)0x0000000A << (4 *(pin)))
#define GPIO_CFGLR_AFO_PP_F(pin) ((u32_t)0x0000000B << (4 *(pin)))
#define GPIO_CFGLR_AFO_OD(pin) ((u32_t)0x0000000D << (4 *(pin)))
#define GPIO_CFGLR_AFO_OD_S(pin) ((u32_t)0x0000000E << (4 *(pin)))
#define GPIO_CFGLR_AFO_OD_F(pin) ((u32_t)0x0000000F << (4 *(pin)))

