rksdna/swamp-v2/ch32v003_registers.h
#define GPIO_CFGHR_MODE ((u32_t)0x33333333)
#define GPIO_CFGHR_MODE8 ((u32_t)0x00000003)
#define GPIO_CFGHR_MODE8_0 ((u32_t)0x00000001)
#define GPIO_CFGHR_MODE8_1 ((u32_t)0x00000002)
#define GPIO_CFGHR_MODE9 ((u32_t)0x00000030)
#define GPIO_CFGHR_MODE9_0 ((u32_t)0x00000010)
#define GPIO_CFGHR_MODE9_1 ((u32_t)0x00000020)
#define GPIO_CFGHR_MODE10 ((u32_t)0x00000300)
#define GPIO_CFGHR_MODE10_0 ((u32_t)0x00000100)
#define GPIO_CFGHR_MODE10_1 ((u32_t)0x00000200)
#define GPIO_CFGHR_MODE11 ((u32_t)0x00003000)
#define GPIO_CFGHR_MODE11_0 ((u32_t)0x00001000)
#define GPIO_CFGHR_MODE11_1 ((u32_t)0x00002000)
#define GPIO_CFGHR_MODE12 ((u32_t)0x00030000)
#define GPIO_CFGHR_MODE12_0 ((u32_t)0x00010000)
#define GPIO_CFGHR_MODE12_1 ((u32_t)0x00020000)
#define GPIO_CFGHR_MODE13 ((u32_t)0x00300000)
#define GPIO_CFGHR_MODE13_0 ((u32_t)0x00100000)
#define GPIO_CFGHR_MODE13_1 ((u32_t)0x00200000)
#define GPIO_CFGHR_MODE14 ((u32_t)0x03000000)
#define GPIO_CFGHR_MODE14_0 ((u32_t)0x01000000)
#define GPIO_CFGHR_MODE14_1 ((u32_t)0x02000000)
#define GPIO_CFGHR_MODE15 ((u32_t)0x30000000)
#define GPIO_CFGHR_MODE15_0 ((u32_t)0x10000000)
#define GPIO_CFGHR_MODE15_1 ((u32_t)0x20000000)
#define GPIO_CFGHR_CNF ((u32_t)0xCCCCCCCC)
#define GPIO_CFGHR_CNF8 ((u32_t)0x0000000C)
#define GPIO_CFGHR_CNF8_0 ((u32_t)0x00000004)
#define GPIO_CFGHR_CNF8_1 ((u32_t)0x00000008)
#define GPIO_CFGHR_CNF9 ((u32_t)0x000000C0)
#define GPIO_CFGHR_CNF9_0 ((u32_t)0x00000040)
#define GPIO_CFGHR_CNF9_1 ((u32_t)0x00000080)
#define GPIO_CFGHR_CNF10 ((u32_t)0x00000C00)
#define GPIO_CFGHR_CNF10_0 ((u32_t)0x00000400)
#define GPIO_CFGHR_CNF10_1 ((u32_t)0x00000800)
#define GPIO_CFGHR_CNF11 ((u32_t)0x0000C000)
#define GPIO_CFGHR_CNF11_0 ((u32_t)0x00004000)
#define GPIO_CFGHR_CNF11_1 ((u32_t)0x00008000)
#define GPIO_CFGHR_CNF12 ((u32_t)0x000C0000)
#define GPIO_CFGHR_CNF12_0 ((u32_t)0x00040000)
#define GPIO_CFGHR_CNF12_1 ((u32_t)0x00080000)
#define GPIO_CFGHR_CNF13 ((u32_t)0x00C00000)
#define GPIO_CFGHR_CNF13_0 ((u32_t)0x00400000)
#define GPIO_CFGHR_CNF13_1 ((u32_t)0x00800000)
#define GPIO_CFGHR_CNF14 ((u32_t)0x0C000000)
#define GPIO_CFGHR_CNF14_0 ((u32_t)0x04000000)
#define GPIO_CFGHR_CNF14_1 ((u32_t)0x08000000)
#define GPIO_CFGHR_CNF15 ((u32_t)0xC0000000)
#define GPIO_CFGHR_CNF15_0 ((u32_t)0x40000000)
#define GPIO_CFGHR_CNF15_1 ((u32_t)0x80000000)

#define GPIO_CFGHR_GPI_AN(pin) ((u32_t)0x00000000 << (4 * ((pin) - 8)))
#define GPIO_CFGHR_GPI_FL(pin) ((u32_t)0x00000004 << (4 * ((pin) - 8)))
#define GPIO_CFGHR_GPI_PU(pin) ((u32_t)0x00000008 << (4 * ((pin) - 8)))
#define GPIO_CFGHR_GPO_PP(pin) ((u32_t)0x00000001 << (4 * ((pin) - 8)))
#define GPIO_CFGHR_GPO_PP_S(pin) ((u32_t)0x00000002 << (4 * ((pin) - 8)))
#define GPIO_CFGHR_GPO_PP_F(pin) ((u32_t)0x00000003 << (4 * ((pin) - 8)))
#define GPIO_CFGHR_GPO_OD(pin) ((u32_t)0x00000005 << (4 * ((pin) - 8)))
#define GPIO_CFGHR_GPO_OD_S(pin) ((u32_t)0x00000006 << (4 * ((pin) - 8)))
#define GPIO_CFGHR_GPO_OD_F(pin) ((u32_t)0x00000007 << (4 * ((pin) - 8)))
#define GPIO_CFGHR_AFO_PP(pin) ((u32_t)0x00000009 << (4 * ((pin) - 8)))
#define GPIO_CFGHR_AFO_PP_S(pin) ((u32_t)0x0000000A << (4 * ((pin) - 8)))
#define GPIO_CFGHR_AFO_PP_F(pin) ((u32_t)0x0000000B << (4 * ((pin) - 8)))
#define GPIO_CFGHR_AFO_OD(pin) ((u32_t)0x0000000D << (4 * ((pin) - 8)))
#define GPIO_CFGHR_AFO_OD_S(pin) ((u32_t)0x0000000E << (4 * ((pin) - 8)))
#define GPIO_CFGHR_AFO_OD_F(pin) ((u32_t)0x0000000F << (4 * ((pin) - 8)))

#define GPIO_INDR_IDR0 ((u16_t)0x0001)
#define GPIO_INDR_IDR1 ((u16_t)0x0002)
#define GPIO_INDR_IDR2 ((u16_t)0x0004)
#define GPIO_INDR_IDR3 ((u16_t)0x0008)
#define GPIO_INDR_IDR4 ((u16_t)0x0010)
#define GPIO_INDR_IDR5 ((u16_t)0x0020)
#define GPIO_INDR_IDR6 ((u16_t)0x0040)
#define GPIO_INDR_IDR7 ((u16_t)0x0080)
#define GPIO_INDR_IDR8 ((u16_t)0x0100)
#define GPIO_INDR_IDR9 ((u16_t)0x0200)
#define GPIO_INDR_IDR10 ((u16_t)0x0400)
#define GPIO_INDR_IDR11 ((u16_t)0x0800)
#define GPIO_INDR_IDR12 ((u16_t)0x1000)
#define GPIO_INDR_IDR13 ((u16_t)0x2000)
#define GPIO_INDR_IDR14 ((u16_t)0x4000)
#define GPIO_INDR_IDR15 ((u16_t)0x8000)

#define GPIO_OUTDR_ODR0 ((u16_t)0x0001)
#define GPIO_OUTDR_ODR1 ((u16_t)0x0002)
#define GPIO_OUTDR_ODR2 ((u16_t)0x0004)
#define GPIO_OUTDR_ODR3 ((u16_t)0x0008)
#define GPIO_OUTDR_ODR4 ((u16_t)0x0010)
#define GPIO_OUTDR_ODR5 ((u16_t)0x0020)
#define GPIO_OUTDR_ODR6 ((u16_t)0x0040)
#define GPIO_OUTDR_ODR7 ((u16_t)0x0080)
#define GPIO_OUTDR_ODR8 ((u16_t)0x0100)
#define GPIO_OUTDR_ODR9 ((u16_t)0x0200)
#define GPIO_OUTDR_ODR10 ((u16_t)0x0400)
#define GPIO_OUTDR_ODR11 ((u16_t)0x0800)
#define GPIO_OUTDR_ODR12 ((u16_t)0x1000)
#define GPIO_OUTDR_ODR13 ((u16_t)0x2000)
#define GPIO_OUTDR_ODR14 ((u16_t)0x4000)
#define GPIO_OUTDR_ODR15 ((u16_t)0x8000)

#define GPIO_BSHR_BS0 ((u32_t)0x00000001)
#define GPIO_BSHR_BS1 ((u32_t)0x00000002)
#define GPIO_BSHR_BS2 ((u32_t)0x00000004)
#define GPIO_BSHR_BS3 ((u32_t)0x00000008)
#define GPIO_BSHR_BS4 ((u32_t)0x00000010)
#define GPIO_BSHR_BS5 ((u32_t)0x00000020)
#define GPIO_BSHR_BS6 ((u32_t)0x00000040)
#define GPIO_BSHR_BS7 ((u32_t)0x00000080)
#define GPIO_BSHR_BS8 ((u32_t)0x00000100)
#define GPIO_BSHR_BS9 ((u32_t)0x00000200)
#define GPIO_BSHR_BS10 ((u32_t)0x00000400)
#define GPIO_BSHR_BS11 ((u32_t)0x00000800)
#define GPIO_BSHR_BS12 ((u32_t)0x00001000)
#define GPIO_BSHR_BS13 ((u32_t)0x00002000)
#define GPIO_BSHR_BS14 ((u32_t)0x00004000)
#define GPIO_BSHR_BS15 ((u32_t)0x00008000)

#define GPIO_BSHR_BR0 ((u32_t)0x00010000)
#define GPIO_BSHR_BR1 ((u32_t)0x00020000)
#define GPIO_BSHR_BR2 ((u32_t)0x00040000)
#define GPIO_BSHR_BR3 ((u32_t)0x00080000)
#define GPIO_BSHR_BR4 ((u32_t)0x00100000)
#define GPIO_BSHR_BR5 ((u32_t)0x00200000)
#define GPIO_BSHR_BR6 ((u32_t)0x00400000)
#define GPIO_BSHR_BR7 ((u32_t)0x00800000)
#define GPIO_BSHR_BR8 ((u32_t)0x01000000)
#define GPIO_BSHR_BR9 ((u32_t)0x02000000)
#define GPIO_BSHR_BR10 ((u32_t)0x04000000)
#define GPIO_BSHR_BR11 ((u32_t)0x08000000)
#define GPIO_BSHR_BR12 ((u32_t)0x10000000)
#define GPIO_BSHR_BR13 ((u32_t)0x20000000)
#define GPIO_BSHR_BR14 ((u32_t)0x40000000)
#define GPIO_BSHR_BR15 ((u32_t)0x80000000)

#define GPIO_BCR_BR0 ((u16_t)0x0001)
#define GPIO_BCR_BR1 ((u16_t)0x0002)
#define GPIO_BCR_BR2 ((u16_t)0x0004)
#define GPIO_BCR_BR3 ((u16_t)0x0008)
#define GPIO_BCR_BR4 ((u16_t)0x0010)
#define GPIO_BCR_BR5 ((u16_t)0x0020)
#define GPIO_BCR_BR6 ((u16_t)0x0040)
#define GPIO_BCR_BR7 ((u16_t)0x0080)
#define GPIO_BCR_BR8 ((u16_t)0x0100)
#define GPIO_BCR_BR9 ((u16_t)0x0200)
#define GPIO_BCR_BR10 ((u16_t)0x0400)
#define GPIO_BCR_BR11 ((u16_t)0x0800)
#define GPIO_BCR_BR12 ((u16_t)0x1000)
#define GPIO_BCR_BR13 ((u16_t)0x2000)
#define GPIO_BCR_BR14 ((u16_t)0x4000)
#define GPIO_BCR_BR15 ((u16_t)0x8000)

#define GPIO_LCK0 ((u32_t)0x00000001)
#define GPIO_LCK1 ((u32_t)0x00000002)
#define GPIO_LCK2 ((u32_t)0x00000004)
#define GPIO_LCK3 ((u32_t)0x00000008)
#define GPIO_LCK4 ((u32_t)0x00000010)
#define GPIO_LCK5 ((u32_t)0x00000020)
#define GPIO_LCK6 ((u32_t)0x00000040)
#define GPIO_LCK7 ((u32_t)0x00000080)
#define GPIO_LCK8 ((u32_t)0x00000100)
#define GPIO_LCK9 ((u32_t)0x00000200)
#define GPIO_LCK10 ((u32_t)0x00000400)
#define GPIO_LCK11 ((u32_t)0x00000800)
#define GPIO_LCK12 ((u32_t)0x00001000)
#define GPIO_LCK13 ((u32_t)0x00002000)
#define GPIO_LCK14 ((u32_t)0x00004000)
#define GPIO_LCK15 ((u32_t)0x00008000)
#define GPIO_LCKK ((u32_t)0x00010000)

struct ch32v003_afio
{
    u32_t RESERVED0;
    volatile u32_t PCFR1;
    volatile u32_t EXTICR;
};

