rksdna/swamp-v2/ch32v003_registers.h
#define AFIO ((struct ch32v003_afio*)0x40010000)

#define AFIO_PCFR1_SPI1_REMAP ((u32_t)0x00000001)
#define AFIO_PCFR1_I2C1_REMAP ((u32_t)0x00000002)
#define AFIO_PCFR1_USART1_REMAP ((u32_t)0x00000004)
#define AFIO_PCFR1_USART2_REMAP ((u32_t)0x00000008)
#define AFIO_PCFR1_USART3_REMAP ((u32_t)0x00000030)
#define AFIO_PCFR1_USART3_REMAP_0 ((u32_t)0x00000010)
#define AFIO_PCFR1_USART3_REMAP_1 ((u32_t)0x00000020)
#define AFIO_PCFR1_USART3_REMAP_NOREMAP ((u32_t)0x00000000)
#define AFIO_PCFR1_USART3_REMAP_PARTIALREMAP ((u32_t)0x00000010)
#define AFIO_PCFR1_USART3_REMAP_FULLREMAP ((u32_t)0x00000030)
#define AFIO_PCFR1_TIM1_REMAP ((u32_t)0x000000C0)
#define AFIO_PCFR1_TIM1_REMAP_0 ((u32_t)0x00000040)
#define AFIO_PCFR1_TIM1_REMAP_1 ((u32_t)0x00000080)
#define AFIO_PCFR1_TIM1_REMAP_NOREMAP ((u32_t)0x00000000)
#define AFIO_PCFR1_TIM1_REMAP_PARTIALREMAP ((u32_t)0x00000040)
#define AFIO_PCFR1_TIM1_REMAP_FULLREMAP ((u32_t)0x000000C0)
#define AFIO_PCFR1_TIM2_REMAP ((u32_t)0x00000300)
#define AFIO_PCFR1_TIM2_REMAP_0 ((u32_t)0x00000100)
#define AFIO_PCFR1_TIM2_REMAP_1 ((u32_t)0x00000200)
#define AFIO_PCFR1_TIM2_REMAP_NOREMAP ((u32_t)0x00000000)
#define AFIO_PCFR1_TIM2_REMAP_PARTIALREMAP1 ((u32_t)0x00000100)
#define AFIO_PCFR1_TIM2_REMAP_PARTIALREMAP2 ((u32_t)0x00000200)
#define AFIO_PCFR1_TIM2_REMAP_FULLREMAP ((u32_t)0x00000300)
#define AFIO_PCFR1_TIM3_REMAP ((u32_t)0x00000C00)
#define AFIO_PCFR1_TIM3_REMAP_0 ((u32_t)0x00000400)
#define AFIO_PCFR1_TIM3_REMAP_1 ((u32_t)0x00000800)
#define AFIO_PCFR1_TIM3_REMAP_NOREMAP ((u32_t)0x00000000)
#define AFIO_PCFR1_TIM3_REMAP_PARTIALREMAP ((u32_t)0x00000800)
#define AFIO_PCFR1_TIM3_REMAP_FULLREMAP ((u32_t)0x00000C00)
#define AFIO_PCFR1_TIM4_REMAP ((u32_t)0x00001000)
#define AFIO_PCFR1_CAN_REMAP ((u32_t)0x00006000)
#define AFIO_PCFR1_CAN_REMAP_0 ((u32_t)0x00002000)
#define AFIO_PCFR1_CAN_REMAP_1 ((u32_t)0x00004000)
#define AFIO_PCFR1_CAN_REMAP_REMAP1 ((u32_t)0x00000000)
#define AFIO_PCFR1_CAN_REMAP_REMAP2 ((u32_t)0x00004000)
#define AFIO_PCFR1_CAN_REMAP_REMAP3 ((u32_t)0x00006000)
#define AFIO_PCFR1_PA12_REMAP ((u32_t)0x00008000)
#define AFIO_PCFR1_TIM5CH4_IREMAP ((u32_t)0x00010000)
#define AFIO_PCFR1_ADC1_ETRGINJ_REMAP ((u32_t)0x00020000)
#define AFIO_PCFR1_ADC1_ETRGREG_REMAP ((u32_t)0x00040000)
#define AFIO_PCFR1_ADC2_ETRGINJ_REMAP ((u32_t)0x00080000)
#define AFIO_PCFR1_ADC2_ETRGREG_REMAP ((u32_t)0x00100000)
#define AFIO_PCFR1_SWJ_CFG ((u32_t)0x07000000)
#define AFIO_PCFR1_SWJ_CFG_0 ((u32_t)0x01000000)
#define AFIO_PCFR1_SWJ_CFG_1 ((u32_t)0x02000000)
#define AFIO_PCFR1_SWJ_CFG_2 ((u32_t)0x04000000)
#define AFIO_PCFR1_SWJ_CFG_RESET ((u32_t)0x00000000)
#define AFIO_PCFR1_SWJ_CFG_NOJNTRST ((u32_t)0x01000000)
#define AFIO_PCFR1_SWJ_CFG_JTAGDISABLE ((u32_t)0x02000000)
#define AFIO_PCFR1_SWJ_CFG_DISABLE ((u32_t)0x04000000)

#define AFIO_EXTICR1_EXTI0 ((u16_t)0x000F)
#define AFIO_EXTICR1_EXTI1 ((u16_t)0x00F0)
#define AFIO_EXTICR1_EXTI2 ((u16_t)0x0F00)
#define AFIO_EXTICR1_EXTI3 ((u16_t)0xF000)
#define AFIO_EXTICR1_EXTI0_PA ((u16_t)0x0000)
#define AFIO_EXTICR1_EXTI0_PB ((u16_t)0x0001)
#define AFIO_EXTICR1_EXTI0_PC ((u16_t)0x0002)
#define AFIO_EXTICR1_EXTI0_PD ((u16_t)0x0003)
#define AFIO_EXTICR1_EXTI0_PE ((u16_t)0x0004)
#define AFIO_EXTICR1_EXTI0_PF ((u16_t)0x0005)
#define AFIO_EXTICR1_EXTI0_PG ((u16_t)0x0006)
#define AFIO_EXTICR1_EXTI1_PA ((u16_t)0x0000)
#define AFIO_EXTICR1_EXTI1_PB ((u16_t)0x0010)
#define AFIO_EXTICR1_EXTI1_PC ((u16_t)0x0020)
#define AFIO_EXTICR1_EXTI1_PD ((u16_t)0x0030)
#define AFIO_EXTICR1_EXTI1_PE ((u16_t)0x0040)
#define AFIO_EXTICR1_EXTI1_PF ((u16_t)0x0050)
#define AFIO_EXTICR1_EXTI1_PG ((u16_t)0x0060)
#define AFIO_EXTICR1_EXTI2_PA ((u16_t)0x0000)
#define AFIO_EXTICR1_EXTI2_PB ((u16_t)0x0100)
#define AFIO_EXTICR1_EXTI2_PC ((u16_t)0x0200)
#define AFIO_EXTICR1_EXTI2_PD ((u16_t)0x0300)
#define AFIO_EXTICR1_EXTI2_PE ((u16_t)0x0400)
#define AFIO_EXTICR1_EXTI2_PF ((u16_t)0x0500)
#define AFIO_EXTICR1_EXTI2_PG ((u16_t)0x0600)
#define AFIO_EXTICR1_EXTI3_PA ((u16_t)0x0000)
#define AFIO_EXTICR1_EXTI3_PB ((u16_t)0x1000)
#define AFIO_EXTICR1_EXTI3_PC ((u16_t)0x2000)
#define AFIO_EXTICR1_EXTI3_PD ((u16_t)0x3000)
#define AFIO_EXTICR1_EXTI3_PE ((u16_t)0x4000)
#define AFIO_EXTICR1_EXTI3_PF ((u16_t)0x5000)
#define AFIO_EXTICR1_EXTI3_PG ((u16_t)0x6000)

struct ch32v003_i2c
{
    volatile u16_t CTLR1;
    u16_t RESERVED0;
    volatile u16_t CTLR2;
    u16_t RESERVED1;
    volatile u16_t OADDR1;
    u16_t RESERVED2;
    volatile u16_t OADDR2;
    u16_t RESERVED3;
    volatile u16_t DATAR;
    u16_t RESERVED4;
    volatile u16_t STAR1;
    u16_t RESERVED5;
    volatile u16_t STAR2;
    u16_t RESERVED6;
    volatile u16_t CKCFGR;
    u16_t RESERVED7;
};

#define I2C1 ((struct ch32v003_i2c*)0x40005400)

#define I2C_CTLR1_PE ((u16_t)0x0001)
#define I2C_CTLR1_SMBUS ((u16_t)0x0002)
#define I2C_CTLR1_SMBTYPE ((u16_t)0x0008)
#define I2C_CTLR1_ENARP ((u16_t)0x0010)
#define I2C_CTLR1_ENPEC ((u16_t)0x0020)
#define I2C_CTLR1_ENGC ((u16_t)0x0040)
#define I2C_CTLR1_NOSTRETCH ((u16_t)0x0080)
#define I2C_CTLR1_START ((u16_t)0x0100)
#define I2C_CTLR1_STOP ((u16_t)0x0200)
#define I2C_CTLR1_ACK ((u16_t)0x0400)
#define I2C_CTLR1_POS ((u16_t)0x0800)
#define I2C_CTLR1_PEC ((u16_t)0x1000)
#define I2C_CTLR1_ALERT ((u16_t)0x2000)
#define I2C_CTLR1_SWRST ((u16_t)0x8000)

#define I2C_CTLR2_FREQ ((u16_t)0x003F)
#define I2C_CTLR2_FREQ_0 ((u16_t)0x0001)
#define I2C_CTLR2_FREQ_1 ((u16_t)0x0002)
#define I2C_CTLR2_FREQ_2 ((u16_t)0x0004)
#define I2C_CTLR2_FREQ_3 ((u16_t)0x0008)
#define I2C_CTLR2_FREQ_4 ((u16_t)0x0010)
#define I2C_CTLR2_FREQ_5 ((u16_t)0x0020)

#define I2C_CTLR2_ITERREN ((u16_t)0x0100)
#define I2C_CTLR2_ITEVTEN ((u16_t)0x0200)
#define I2C_CTLR2_ITBUFEN ((u16_t)0x0400)
#define I2C_CTLR2_DMAEN ((u16_t)0x0800)
#define I2C_CTLR2_LAST ((u16_t)0x1000)

#define I2C_OADDR1_ADD1_7 ((u16_t)0x00FE)
#define I2C_OADDR1_ADD8_9 ((u16_t)0x0300)
#define I2C_OADDR1_ADD0 ((u16_t)0x0001)
#define I2C_OADDR1_ADD1 ((u16_t)0x0002)
#define I2C_OADDR1_ADD2 ((u16_t)0x0004)
#define I2C_OADDR1_ADD3 ((u16_t)0x0008)
#define I2C_OADDR1_ADD4 ((u16_t)0x0010)
#define I2C_OADDR1_ADD5 ((u16_t)0x0020)
#define I2C_OADDR1_ADD6 ((u16_t)0x0040)
#define I2C_OADDR1_ADD7 ((u16_t)0x0080)
#define I2C_OADDR1_ADD8 ((u16_t)0x0100)
#define I2C_OADDR1_ADD9 ((u16_t)0x0200)
#define I2C_OADDR1_ADDMODE ((u16_t)0x8000)

