rksdna/swamp-v2/ch32v003_registers.h
#define I2C_OADDR2_ENDUAL ((u8_t)0x01)
#define I2C_OADDR2_ADD2 ((u8_t)0xFE)

#define I2C_DR_DATAR ((u8_t)0xFF)

#define I2C_STAR1_SB ((u16_t)0x0001)
#define I2C_STAR1_ADDR ((u16_t)0x0002)
#define I2C_STAR1_BTF ((u16_t)0x0004)
#define I2C_STAR1_ADD10 ((u16_t)0x0008)
#define I2C_STAR1_STOPF ((u16_t)0x0010)
#define I2C_STAR1_RXNE ((u16_t)0x0040)
#define I2C_STAR1_TXE ((u16_t)0x0080)
#define I2C_STAR1_BERR ((u16_t)0x0100)
#define I2C_STAR1_ARLO ((u16_t)0x0200)
#define I2C_STAR1_AF ((u16_t)0x0400)
#define I2C_STAR1_OVR ((u16_t)0x0800)
#define I2C_STAR1_PECERR ((u16_t)0x1000)
#define I2C_STAR1_TIMEOUT ((u16_t)0x4000)
#define I2C_STAR1_SMBALERT ((u16_t)0x8000)

#define I2C_STAR2_MSL ((u16_t)0x0001)
#define I2C_STAR2_BUSY ((u16_t)0x0002)
#define I2C_STAR2_TRA ((u16_t)0x0004)
#define I2C_STAR2_GENCALL ((u16_t)0x0010)
#define I2C_STAR2_SMBDEFAULT ((u16_t)0x0020)
#define I2C_STAR2_SMBHOST ((u16_t)0x0040)
#define I2C_STAR2_DUALF ((u16_t)0x0080)
#define I2C_STAR2_PEC ((u16_t)0xFF00)

#define I2C_CKCFGR_CCR ((u16_t)0x0FFF)
#define I2C_CKCFGR_DUTY ((u16_t)0x4000)
#define I2C_CKCFGR_FS ((u16_t)0x8000)

struct ch32v003_iwdg
{
    volatile u32_t CTLR;
    volatile u32_t PSCR;
    volatile u32_t RLDR;
    volatile u32_t STATR;
};

#define IWDG ((struct ch32v003_iwdg*)0x40003000)

#define IWDG_CTLR_KEY ((u16_t)0xFFFF)

#define IWDG_PSCR_PR ((u8_t)0x07)
#define IWDG_PSCR_PR_0 ((u8_t)0x01)
#define IWDG_PSCR_PR_1 ((u8_t)0x02)
#define IWDG_PSCR_PR_2 ((u8_t)0x04)

#define IWDG_RLDR_RL ((u16_t)0x0FFF)

#define IWDG_STATR_PVU ((u8_t)0x01)
#define IWDG_STATR_RVU ((u8_t)0x02)

struct ch32v003_pwr
{
    volatile u32_t CTLR;
    volatile u32_t CSR;
    volatile u32_t AWUCSR;
    volatile u32_t AWUWR;
    volatile u32_t AWUPSC;
};

#define PWR ((struct ch32v003_pwr*)0x40007000)

#define PWR_CTLR_LPDS ((u16_t)0x0001)
#define PWR_CTLR_PDDS ((u16_t)0x0002)
#define PWR_CTLR_CWUF ((u16_t)0x0004)
#define PWR_CTLR_CSBF ((u16_t)0x0008)
#define PWR_CTLR_PVDE ((u16_t)0x0010)
#define PWR_CTLR_PLS ((u16_t)0x00E0)
#define PWR_CTLR_PLS_0 ((u16_t)0x0020)
#define PWR_CTLR_PLS_1 ((u16_t)0x0040)
#define PWR_CTLR_PLS_2 ((u16_t)0x0080)
#define PWR_CTLR_PLS_2V2 ((u16_t)0x0000)
#define PWR_CTLR_PLS_2V3 ((u16_t)0x0020)
#define PWR_CTLR_PLS_2V4 ((u16_t)0x0040)
#define PWR_CTLR_PLS_2V5 ((u16_t)0x0060)
#define PWR_CTLR_PLS_2V6 ((u16_t)0x0080)
#define PWR_CTLR_PLS_2V7 ((u16_t)0x00A0)
#define PWR_CTLR_PLS_2V8 ((u16_t)0x00C0)
#define PWR_CTLR_PLS_2V9 ((u16_t)0x00E0)
#define PWR_CTLR_DBP ((u16_t)0x0100)

#define PWR_CSR_WUF ((u16_t)0x0001)
#define PWR_CSR_SBF ((u16_t)0x0002)
#define PWR_CSR_PVDO ((u16_t)0x0004)
#define PWR_CSR_EWUP ((u16_t)0x0100)

struct ch32v003_rcc
{
    volatile u32_t CTLR;
    volatile u32_t CFGR0;
    volatile u32_t INTR;
    volatile u32_t APB2PRSTR;
    volatile u32_t APB1PRSTR;
    volatile u32_t AHBPCENR;
    volatile u32_t APB2PCENR;
    volatile u32_t APB1PCENR;
    volatile u32_t RESERVED0;
    volatile u32_t RSTSCKR;
};

#define RCC ((struct ch32v003_rcc*)0x40021000)

#define RCC_CTLR_HSION ((u32_t)0x00000001)
#define RCC_CTLR_HSIRDY ((u32_t)0x00000002)
#define RCC_CTLR_HSITRIM ((u32_t)0x000000F8)
#define RCC_CTLR_HSICAL ((u32_t)0x0000FF00)
#define RCC_CTLR_HSEON ((u32_t)0x00010000)
#define RCC_CTLR_HSERDY ((u32_t)0x00020000)
#define RCC_CTLR_HSEBYP ((u32_t)0x00040000)
#define RCC_CTLR_CSSON ((u32_t)0x00080000)
#define RCC_CTLR_PLLON ((u32_t)0x01000000)
#define RCC_CTLR_PLLRDY ((u32_t)0x02000000)

#define RCC_CFGR0_SW ((u32_t)0x00000003)
#define RCC_CFGR0_SW_0 ((u32_t)0x00000001)
#define RCC_CFGR0_SW_1 ((u32_t)0x00000002)
#define RCC_CFGR0_SW_HSI ((u32_t)0x00000000)
#define RCC_CFGR0_SW_HSE ((u32_t)0x00000001)
#define RCC_CFGR0_SW_PLL ((u32_t)0x00000002)
#define RCC_CFGR0_SWS ((u32_t)0x0000000C)
#define RCC_CFGR0_SWS_0 ((u32_t)0x00000004)
#define RCC_CFGR0_SWS_1 ((u32_t)0x00000008)
#define RCC_CFGR0_SWS_HSI ((u32_t)0x00000000)
#define RCC_CFGR0_SWS_HSE ((u32_t)0x00000004)
#define RCC_CFGR0_SWS_PLL ((u32_t)0x00000008)
#define RCC_CFGR0_HPRE ((u32_t)0x000000F0)
#define RCC_CFGR0_HPRE_0 ((u32_t)0x00000010)
#define RCC_CFGR0_HPRE_1 ((u32_t)0x00000020)
#define RCC_CFGR0_HPRE_2 ((u32_t)0x00000040)
#define RCC_CFGR0_HPRE_3 ((u32_t)0x00000080)
#define RCC_CFGR0_HPRE_DIV1 ((u32_t)0x00000000)
#define RCC_CFGR0_HPRE_DIV2 ((u32_t)0x00000010)
#define RCC_CFGR0_HPRE_DIV3 ((u32_t)0x00000020)
#define RCC_CFGR0_HPRE_DIV4 ((u32_t)0x00000030)
#define RCC_CFGR0_HPRE_DIV5 ((u32_t)0x00000040)
#define RCC_CFGR0_HPRE_DIV6 ((u32_t)0x00000050)
#define RCC_CFGR0_HPRE_DIV7 ((u32_t)0x00000060)
#define RCC_CFGR0_HPRE_DIV8 ((u32_t)0x00000070)
#define RCC_CFGR0_HPRE_DIV16 ((u32_t)0x000000B0)
#define RCC_CFGR0_HPRE_DIV32 ((u32_t)0x000000C0)
#define RCC_CFGR0_HPRE_DIV64 ((u32_t)0x000000D0)
#define RCC_CFGR0_HPRE_DIV128 ((u32_t)0x000000E0)
#define RCC_CFGR0_HPRE_DIV256 ((u32_t)0x000000F0)
#define RCC_CFGR0_PPRE1 ((u32_t)0x00000700)
#define RCC_CFGR0_PPRE1_0 ((u32_t)0x00000100)
#define RCC_CFGR0_PPRE1_1 ((u32_t)0x00000200)
#define RCC_CFGR0_PPRE1_2 ((u32_t)0x00000400)
#define RCC_CFGR0_PPRE1_DIV1 ((u32_t)0x00000000)
#define RCC_CFGR0_PPRE1_DIV2 ((u32_t)0x00000400)
#define RCC_CFGR0_PPRE1_DIV4 ((u32_t)0x00000500)
#define RCC_CFGR0_PPRE1_DIV8 ((u32_t)0x00000600)
#define RCC_CFGR0_PPRE1_DIV16 ((u32_t)0x00000700)
#define RCC_CFGR0_PPRE2 ((u32_t)0x00003800)
#define RCC_CFGR0_PPRE2_0 ((u32_t)0x00000800)
#define RCC_CFGR0_PPRE2_1 ((u32_t)0x00001000)
#define RCC_CFGR0_PPRE2_2 ((u32_t)0x00002000)
#define RCC_CFGR0_PPRE2_DIV1 ((u32_t)0x00000000)
#define RCC_CFGR0_PPRE2_DIV2 ((u32_t)0x00002000)
#define RCC_CFGR0_PPRE2_DIV4 ((u32_t)0x00002800)
#define RCC_CFGR0_PPRE2_DIV8 ((u32_t)0x00003000)
#define RCC_CFGR0_PPRE2_DIV16 ((u32_t)0x00003800)
#define RCC_CFGR0_ADCPRE ((u32_t)0x0000C000)
#define RCC_CFGR0_ADCPRE_0 ((u32_t)0x00004000)
#define RCC_CFGR0_ADCPRE_1 ((u32_t)0x00008000)
#define RCC_CFGR0_ADCPRE_DIV2 ((u32_t)0x00000000)
#define RCC_CFGR0_ADCPRE_DIV4 ((u32_t)0x00004000)
#define RCC_CFGR0_ADCPRE_DIV6 ((u32_t)0x00008000)
#define RCC_CFGR0_ADCPRE_DIV8 ((u32_t)0x0000C000)
#define RCC_CFGR0_PLLSRC ((u32_t)0x00010000)
#define RCC_CFGR0_PLLXTPRE ((u32_t)0x00020000)
#define RCC_CFGR0_PLLMULL ((u32_t)0x003C0000)
#define RCC_CFGR0_PLLMULL_0 ((u32_t)0x00040000)
#define RCC_CFGR0_PLLMULL_1 ((u32_t)0x00080000)
#define RCC_CFGR0_PLLMULL_2 ((u32_t)0x00100000)
#define RCC_CFGR0_PLLMULL_3 ((u32_t)0x00200000)
#define RCC_CFGR0_PLLSRC_HSI_Mul2 ((u32_t)0x00000000)
#define RCC_CFGR0_PLLSRC_HSE_Mul2 ((u32_t)0x00010000)
#define RCC_CFGR0_PLLXTPRE_HSE ((u32_t)0x00000000)
#define RCC_CFGR0_PLLXTPRE_HSE_Div2 ((u32_t)0x00020000)
#define RCC_CFGR0_PLLMULL2 ((u32_t)0x00000000)
#define RCC_CFGR0_PLLMULL3 ((u32_t)0x00040000)
#define RCC_CFGR0_PLLMULL4 ((u32_t)0x00080000)
#define RCC_CFGR0_PLLMULL5 ((u32_t)0x000C0000)
#define RCC_CFGR0_PLLMULL6 ((u32_t)0x00100000)
#define RCC_CFGR0_PLLMULL7 ((u32_t)0x00140000)
#define RCC_CFGR0_PLLMULL8 ((u32_t)0x00180000)
#define RCC_CFGR0_PLLMULL9 ((u32_t)0x001C0000)
#define RCC_CFGR0_PLLMULL10 ((u32_t)0x00200000)
#define RCC_CFGR0_PLLMULL11 ((u32_t)0x00240000)
#define RCC_CFGR0_PLLMULL12 ((u32_t)0x00280000)
#define RCC_CFGR0_PLLMULL13 ((u32_t)0x002C0000)
#define RCC_CFGR0_PLLMULL14 ((u32_t)0x00300000)
#define RCC_CFGR0_PLLMULL15 ((u32_t)0x00340000)
#define RCC_CFGR0_PLLMULL16 ((u32_t)0x00380000)
#define RCC_CFGR0_USBPRE ((u32_t)0x00400000)
#define RCC_CFGR0_CFGR0_MCO ((u32_t)0x07000000)
#define RCC_CFGR0_MCO_0 ((u32_t)0x01000000)
#define RCC_CFGR0_MCO_1 ((u32_t)0x02000000)
#define RCC_CFGR0_MCO_2 ((u32_t)0x04000000)
#define RCC_CFGR0_MCO_NOCLOCK ((u32_t)0x00000000)
#define RCC_CFGR0_MCO_SYSCLK ((u32_t)0x04000000)
#define RCC_CFGR0_MCO_HSI ((u32_t)0x05000000)
#define RCC_CFGR0_MCO_HSE ((u32_t)0x06000000)
#define RCC_CFGR0_MCO_PLL ((u32_t)0x07000000)

#define RCC_INTR_LSIRDYF ((u32_t)0x00000001)
#define RCC_INTR_LSERDYF ((u32_t)0x00000002)
#define RCC_INTR_HSIRDYF ((u32_t)0x00000004)
#define RCC_INTR_HSERDYF ((u32_t)0x00000008)
#define RCC_INTR_PLLRDYF ((u32_t)0x00000010)
#define RCC_INTR_CSSF ((u32_t)0x00000080)
#define RCC_INTR_LSIRDYIE ((u32_t)0x00000100)
#define RCC_INTR_LSERDYIE ((u32_t)0x00000200)
#define RCC_INTR_HSIRDYIE ((u32_t)0x00000400)
#define RCC_INTR_HSERDYIE ((u32_t)0x00000800)
#define RCC_INTR_PLLRDYIE ((u32_t)0x00001000)
#define RCC_INTR_LSIRDYC ((u32_t)0x00010000)
#define RCC_INTR_LSERDYC ((u32_t)0x00020000)
#define RCC_INTR_HSIRDYC ((u32_t)0x00040000)
#define RCC_INTR_HSERDYC ((u32_t)0x00080000)
#define RCC_INTR_PLLRDYC ((u32_t)0x00100000)
#define RCC_INTR_CSSC ((u32_t)0x00800000)

