rksdna/swamp-v2/ch32v003_registers.h
#define RCC_APB2PRSTR_AFIORST ((u32_t)0x00000001)
#define RCC_APB2PRSTR_IOPARST ((u32_t)0x00000004)
#define RCC_APB2PRSTR_IOPBRST ((u32_t)0x00000008)
#define RCC_APB2PRSTR_IOPCRST ((u32_t)0x00000010)
#define RCC_APB2PRSTR_IOPDRST ((u32_t)0x00000020)
#define RCC_APB2PRSTR_ADC1RST ((u32_t)0x00000200)
#define RCC_APB2PRSTR_ADC2RST ((u32_t)0x00000400)
#define RCC_APB2PRSTR_TIM1RST ((u32_t)0x00000800)
#define RCC_APB2PRSTR_SPI1RST ((u32_t)0x00001000)
#define RCC_APB2PRSTR_USART1RST ((u32_t)0x00004000)
#define RCC_APB2PRSTR_IOPERST ((u32_t)0x00000040)

#define RCC_APB1PRSTR_TIM2RST ((u32_t)0x00000001)
#define RCC_APB1PRSTR_TIM3RST ((u32_t)0x00000002)
#define RCC_APB1PRSTR_WWDGRST ((u32_t)0x00000800)
#define RCC_APB1PRSTR_USART2RST ((u32_t)0x00020000)
#define RCC_APB1PRSTR_I2C1RST ((u32_t)0x00200000)
#define RCC_APB1PRSTR_CAN1RST ((u32_t)0x02000000)
#define RCC_APB1PRSTR_BKPRST ((u32_t)0x08000000)
#define RCC_APB1PRSTR_PWRRST ((u32_t)0x10000000)
#define RCC_APB1PRSTR_TIM4RST ((u32_t)0x00000004)
#define RCC_APB1PRSTR_SPI2RST ((u32_t)0x00004000)
#define RCC_APB1PRSTR_USART3RST ((u32_t)0x00040000)
#define RCC_APB1PRSTR_I2C2RST ((u32_t)0x00400000)
#define RCC_APB1PRSTR_USBRST ((u32_t)0x00800000)

#define RCC_AHBPCENR_DMA1EN ((u16_t)0x0001)
#define RCC_AHBPCENR_SRAMEN ((u16_t)0x0004)
#define RCC_AHBPCENR_FLITFEN ((u16_t)0x0010)
#define RCC_AHBPCENR_CRCEN ((u16_t)0x0040)
#define RCC_AHBPCENR_USBHD ((u16_t)0x1000)

#define RCC_APB2PCENR_AFIOEN ((u32_t)0x00000001)
#define RCC_APB2PCENR_IOPAEN ((u32_t)0x00000004)
#define RCC_APB2PCENR_IOPBEN ((u32_t)0x00000008)
#define RCC_APB2PCENR_IOPCEN ((u32_t)0x00000010)
#define RCC_APB2PCENR_IOPDEN ((u32_t)0x00000020)
#define RCC_APB2PCENR_ADC1EN ((u32_t)0x00000200)
#define RCC_APB2PCENR_ADC2EN ((u32_t)0x00000400)
#define RCC_APB2PCENR_TIM1EN ((u32_t)0x00000800)
#define RCC_APB2PCENR_SPI1EN ((u32_t)0x00001000)
#define RCC_APB2PCENR_USART1EN ((u32_t)0x00004000)

#define RCC_APB1PCENR_TIM2EN ((u32_t)0x00000001)
#define RCC_APB1PCENR_TIM3EN ((u32_t)0x00000002)
#define RCC_APB1PCENR_WWDGEN ((u32_t)0x00000800)
#define RCC_APB1PCENR_USART2EN ((u32_t)0x00020000)
#define RCC_APB1PCENR_I2C1EN ((u32_t)0x00200000)
#define RCC_APB1PCENR_BKPEN ((u32_t)0x08000000)
#define RCC_APB1PCENR_PWREN ((u32_t)0x10000000)
#define RCC_APB1PCENR_USBEN ((u32_t)0x00800000)

#define RCC_RSTSCKR_LSION ((u32_t)0x00000001)
#define RCC_RSTSCKR_LSIRDY ((u32_t)0x00000002)
#define RCC_RSTSCKR_RMVF ((u32_t)0x01000000)
#define RCC_RSTSCKR_PINRSTF ((u32_t)0x04000000)
#define RCC_RSTSCKR_PORRSTF ((u32_t)0x08000000)
#define RCC_RSTSCKR_SFTRSTF ((u32_t)0x10000000)
#define RCC_RSTSCKR_IWDGRSTF ((u32_t)0x20000000)
#define RCC_RSTSCKR_WWDGRSTF ((u32_t)0x40000000)
#define RCC_RSTSCKR_LPWRRSTF ((u32_t)0x80000000)

struct ch32v003_spi
{
    volatile u16_t CTLR1;
    u16_t RESERVED0;
    volatile u16_t CTLR2;
    u16_t RESERVED1;
    volatile u16_t STATR;
    u16_t RESERVED2;
    volatile u16_t DATAR;
    u16_t RESERVED3;
    volatile u16_t CRCR;
    u16_t RESERVED4;
    volatile u16_t RCRCR;
    u16_t RESERVED5;
    volatile u16_t TCRCR;
    u16_t RESERVED6;
    u32_t RESERVED7;
    u32_t RESERVED8;
    volatile u16_t HSCR;
    u16_t RESERVED9;
};

#define SPI1 ((struct ch32v003_spi*)0x40013000)

#define SPI_CTLR1_CPHA ((u16_t)0x0001)
#define SPI_CTLR1_CPOL ((u16_t)0x0002)
#define SPI_CTLR1_MSTR ((u16_t)0x0004)
#define SPI_CTLR1_BR ((u16_t)0x0038)
#define SPI_CTLR1_BR_0 ((u16_t)0x0008)
#define SPI_CTLR1_BR_1 ((u16_t)0x0010)
#define SPI_CTLR1_BR_2 ((u16_t)0x0020)
#define SPI_CTLR1_SPE ((u16_t)0x0040)
#define SPI_CTLR1_SSI ((u16_t)0x0100)
#define SPI_CTLR1_SSM ((u16_t)0x0200)
#define SPI_CTLR1_RXONLY ((u16_t)0x0400)
#define SPI_CTLR1_DFF ((u16_t)0x0800)
#define SPI_CTLR1_CRCNEXT ((u16_t)0x1000)
#define SPI_CTLR1_CRCEN ((u16_t)0x2000)
#define SPI_CTLR1_BIDIOE ((u16_t)0x4000)
#define SPI_CTLR1_BIDIMODE ((u16_t)0x8000)

#define SPI_CTLR2_RXDMAEN ((u8_t)0x01)
#define SPI_CTLR2_TXDMAEN ((u8_t)0x02)
#define SPI_CTLR2_SSOE ((u8_t)0x04)
#define SPI_CTLR2_ERRIE ((u8_t)0x20)
#define SPI_CTLR2_RXNEIE ((u8_t)0x40)
#define SPI_CTLR2_TXEIE ((u8_t)0x80)

#define SPI_STATR_RXNE ((u8_t)0x01)
#define SPI_STATR_TXE ((u8_t)0x02)
#define SPI_STATR_CHSIDE ((u8_t)0x04)
#define SPI_STATR_UDR ((u8_t)0x08)
#define SPI_STATR_CRCERR ((u8_t)0x10)
#define SPI_STATR_MODF ((u8_t)0x20)
#define SPI_STATR_OVR ((u8_t)0x40)
#define SPI_STATR_BSY ((u8_t)0x80)

#define SPI_DATAR_DR ((u16_t)0xFFFF)

#define SPI_CRCR_CRCPOLY ((u16_t)0xFFFF)

#define SPI_RCRCR_RXCRC ((u16_t)0xFFFF)

#define SPI_TCRCR_TXCRC ((u16_t)0xFFFF)

struct ch32v003_tim
{
    volatile u16_t CTLR1;
    u16_t RESERVED0;
    volatile u16_t CTLR2;
    u16_t RESERVED1;
    volatile u16_t SMCFGR;
    u16_t RESERVED2;
    volatile u16_t DMAINTENR;
    u16_t RESERVED3;
    volatile u16_t INTFR;
    u16_t RESERVED4;
    volatile u16_t SWEVGR;
    u16_t RESERVED5;
    volatile u16_t CHCTLR1;
    u16_t RESERVED6;
    volatile u16_t CHCTLR2;
    u16_t RESERVED7;
    volatile u16_t CCER;
    u16_t RESERVED8;
    volatile u16_t CNT;
    u16_t RESERVED9;
    volatile u16_t PSC;
    u16_t RESERVED10;
    volatile u16_t ATRLR;
    u16_t RESERVED11;
    volatile u16_t RPTCR;
    u16_t RESERVED12;
    volatile u32_t CH1CVR;
    volatile u32_t CH2CVR;
    volatile u32_t CH3CVR;
    volatile u32_t CH4CVR;
    volatile u16_t BDTR;
    u16_t RESERVED13;
    volatile u16_t DMACFGR;
    u16_t RESERVED14;
    volatile u16_t DMAADR;
    u16_t RESERVED15;
};

#define TIM1 ((struct ch32v003_tim*)0x40012C00)
#define TIM2 ((struct ch32v003_tim*)0x40000000)

#define TIM_CTLR1_CEN ((u16_t)0x0001)
#define TIM_CTLR1_UDIS ((u16_t)0x0002)
#define TIM_CTLR1_URS ((u16_t)0x0004)
#define TIM_CTLR1_OPM ((u16_t)0x0008)
#define TIM_CTLR1_DIR ((u16_t)0x0010)
#define TIM_CTLR1_CMS ((u16_t)0x0060)
#define TIM_CTLR1_CMS_0 ((u16_t)0x0020)
#define TIM_CTLR1_CMS_1 ((u16_t)0x0040)
#define TIM_CTLR1_ARPE ((u16_t)0x0080)
#define TIM_CTLR1_CTLR1_CKD ((u16_t)0x0300)
#define TIM_CTLR1_CKD_0 ((u16_t)0x0100)
#define TIM_CTLR1_CKD_1 ((u16_t)0x0200)

#define TIM_CTLR2_CCPC ((u16_t)0x0001)
#define TIM_CTLR2_CCUS ((u16_t)0x0004)
#define TIM_CTLR2_CCDS ((u16_t)0x0008)
#define TIM_CTLR2_MMS ((u16_t)0x0070)
#define TIM_CTLR2_MMS_0 ((u16_t)0x0010)
#define TIM_CTLR2_MMS_1 ((u16_t)0x0020)
#define TIM_CTLR2_MMS_2 ((u16_t)0x0040)
#define TIM_CTLR2_TI1S ((u16_t)0x0080)
#define TIM_CTLR2_OIS1 ((u16_t)0x0100)
#define TIM_CTLR2_OIS1N ((u16_t)0x0200)
#define TIM_CTLR2_OIS2 ((u16_t)0x0400)
#define TIM_CTLR2_OIS2N ((u16_t)0x0800)
#define TIM_CTLR2_OIS3 ((u16_t)0x1000)
#define TIM_CTLR2_OIS3N ((u16_t)0x2000)
#define TIM_CTLR2_OIS4 ((u16_t)0x4000)

#define TIM_SMCFGR_SMS ((u16_t)0x0007)
#define TIM_SMCFGR_SMS_0 ((u16_t)0x0001)
#define TIM_SMCFGR_SMS_1 ((u16_t)0x0002)
#define TIM_SMCFGR_SMS_2 ((u16_t)0x0004)
#define TIM_SMCFGR_TS ((u16_t)0x0070)
#define TIM_SMCFGR_TS_0 ((u16_t)0x0010)
#define TIM_SMCFGR_TS_1 ((u16_t)0x0020)
#define TIM_SMCFGR_TS_2 ((u16_t)0x0040)
#define TIM_SMCFGR_MSM ((u16_t)0x0080)
#define TIM_SMCFGR_ETF ((u16_t)0x0F00)
#define TIM_SMCFGR_ETF_0 ((u16_t)0x0100)
#define TIM_SMCFGR_ETF_1 ((u16_t)0x0200)
#define TIM_SMCFGR_ETF_2 ((u16_t)0x0400)
#define TIM_SMCFGR_ETF_3 ((u16_t)0x0800)
#define TIM_SMCFGR_ETPS ((u16_t)0x3000)
#define TIM_SMCFGR_ETPS_0 ((u16_t)0x1000)
#define TIM_SMCFGR_ETPS_1 ((u16_t)0x2000)
#define TIM_SMCFGR_ECE ((u16_t)0x4000)
#define TIM_SMCFGR_ETP ((u16_t)0x8000)

#define TIM_DMAINTENR_UIE ((u16_t)0x0001)
#define TIM_DMAINTENR_CC1IE ((u16_t)0x0002)
#define TIM_DMAINTENR_CC2IE ((u16_t)0x0004)
#define TIM_DMAINTENR_CC3IE ((u16_t)0x0008)
#define TIM_DMAINTENR_CC4IE ((u16_t)0x0010)
#define TIM_DMAINTENR_COMIE ((u16_t)0x0020)
#define TIM_DMAINTENR_TIE ((u16_t)0x0040)
#define TIM_DMAINTENR_BIE ((u16_t)0x0080)
#define TIM_DMAINTENR_UDE ((u16_t)0x0100)
#define TIM_DMAINTENR_CC1DE ((u16_t)0x0200)
#define TIM_DMAINTENR_CC2DE ((u16_t)0x0400)
#define TIM_DMAINTENR_CC3DE ((u16_t)0x0800)
#define TIM_DMAINTENR_CC4DE ((u16_t)0x1000)
#define TIM_DMAINTENR_COMDE ((u16_t)0x2000)
#define TIM_DMAINTENR_TDE ((u16_t)0x4000)

