rksdna/swamp-v2/ch32v003_registers.h
#define TIM_INTFR_UIF ((u16_t)0x0001)
#define TIM_INTFR_CC1IF ((u16_t)0x0002)
#define TIM_INTFR_CC2IF ((u16_t)0x0004)
#define TIM_INTFR_CC3IF ((u16_t)0x0008)
#define TIM_INTFR_CC4IF ((u16_t)0x0010)
#define TIM_INTFR_COMIF ((u16_t)0x0020)
#define TIM_INTFR_TIF ((u16_t)0x0040)
#define TIM_INTFR_BIF ((u16_t)0x0080)
#define TIM_INTFR_CC1OF ((u16_t)0x0200)
#define TIM_INTFR_CC2OF ((u16_t)0x0400)
#define TIM_INTFR_CC3OF ((u16_t)0x0800)
#define TIM_INTFR_CC4OF ((u16_t)0x1000)

#define TIM_SWEVGR_UG ((u8_t)0x01)
#define TIM_SWEVGR_CC1G ((u8_t)0x02)
#define TIM_SWEVGR_CC2G ((u8_t)0x04)
#define TIM_SWEVGR_CC3G ((u8_t)0x08)
#define TIM_SWEVGR_CC4G ((u8_t)0x10)
#define TIM_SWEVGR_COMG ((u8_t)0x20)
#define TIM_SWEVGR_TG ((u8_t)0x40)
#define TIM_SWEVGR_BG ((u8_t)0x80)

#define TIM_CHCTLR1_CC1S ((u16_t)0x0003)
#define TIM_CHCTLR1_CC1S_0 ((u16_t)0x0001)
#define TIM_CHCTLR1_CC1S_1 ((u16_t)0x0002)
#define TIM_CHCTLR1_OC1FE ((u16_t)0x0004)
#define TIM_CHCTLR1_OC1PE ((u16_t)0x0008)
#define TIM_CHCTLR1_OC1M ((u16_t)0x0070)
#define TIM_CHCTLR1_OC1M_0 ((u16_t)0x0010)
#define TIM_CHCTLR1_OC1M_1 ((u16_t)0x0020)
#define TIM_CHCTLR1_OC1M_2 ((u16_t)0x0040)
#define TIM_CHCTLR1_OC1CE ((u16_t)0x0080)
#define TIM_CHCTLR1_CC2S ((u16_t)0x0300)
#define TIM_CHCTLR1_CC2S_0 ((u16_t)0x0100)
#define TIM_CHCTLR1_CC2S_1 ((u16_t)0x0200)
#define TIM_CHCTLR1_OC2FE ((u16_t)0x0400)
#define TIM_CHCTLR1_OC2PE ((u16_t)0x0800)
#define TIM_CHCTLR1_OC2M ((u16_t)0x7000)
#define TIM_CHCTLR1_OC2M_0 ((u16_t)0x1000)
#define TIM_CHCTLR1_OC2M_1 ((u16_t)0x2000)
#define TIM_CHCTLR1_OC2M_2 ((u16_t)0x4000)
#define TIM_CHCTLR1_OC2CE ((u16_t)0x8000)
#define TIM_CHCTLR1_IC1PSC ((u16_t)0x000C)
#define TIM_CHCTLR1_IC1PSC_0 ((u16_t)0x0004)
#define TIM_CHCTLR1_IC1PSC_1 ((u16_t)0x0008)
#define TIM_CHCTLR1_IC1F ((u16_t)0x00F0)
#define TIM_CHCTLR1_IC1F_0 ((u16_t)0x0010)
#define TIM_CHCTLR1_IC1F_1 ((u16_t)0x0020)
#define TIM_CHCTLR1_IC1F_2 ((u16_t)0x0040)
#define TIM_CHCTLR1_IC1F_3 ((u16_t)0x0080)
#define TIM_CHCTLR1_IC2PSC ((u16_t)0x0C00)
#define TIM_CHCTLR1_IC2PSC_0 ((u16_t)0x0400)
#define TIM_CHCTLR1_IC2PSC_1 ((u16_t)0x0800)
#define TIM_CHCTLR1_IC2F ((u16_t)0xF000)
#define TIM_CHCTLR1_IC2F_0 ((u16_t)0x1000)
#define TIM_CHCTLR1_IC2F_1 ((u16_t)0x2000)
#define TIM_CHCTLR1_IC2F_2 ((u16_t)0x4000)
#define TIM_CHCTLR1_IC2F_3 ((u16_t)0x8000)

#define TIM_CHCTLR2_CC3S ((u16_t)0x0003)
#define TIM_CHCTLR2_CC3S_0 ((u16_t)0x0001)
#define TIM_CHCTLR2_CC3S_1 ((u16_t)0x0002)
#define TIM_CHCTLR2_OC3FE ((u16_t)0x0004)
#define TIM_CHCTLR2_OC3PE ((u16_t)0x0008)
#define TIM_CHCTLR2_OC3M ((u16_t)0x0070)
#define TIM_CHCTLR2_OC3M_0 ((u16_t)0x0010)
#define TIM_CHCTLR2_OC3M_1 ((u16_t)0x0020)
#define TIM_CHCTLR2_OC3M_2 ((u16_t)0x0040)
#define TIM_CHCTLR2_OC3CE ((u16_t)0x0080)
#define TIM_CHCTLR2_CC4S ((u16_t)0x0300)
#define TIM_CHCTLR2_CC4S_0 ((u16_t)0x0100)
#define TIM_CHCTLR2_CC4S_1 ((u16_t)0x0200)
#define TIM_CHCTLR2_OC4FE ((u16_t)0x0400)
#define TIM_CHCTLR2_OC4PE ((u16_t)0x0800)
#define TIM_CHCTLR2_OC4M ((u16_t)0x7000)
#define TIM_CHCTLR2_OC4M_0 ((u16_t)0x1000)
#define TIM_CHCTLR2_OC4M_1 ((u16_t)0x2000)
#define TIM_CHCTLR2_OC4M_2 ((u16_t)0x4000)
#define TIM_CHCTLR2_OC4CE ((u16_t)0x8000)
#define TIM_CHCTLR2_IC3PSC ((u16_t)0x000C)
#define TIM_CHCTLR2_IC3PSC_0 ((u16_t)0x0004)
#define TIM_CHCTLR2_IC3PSC_1 ((u16_t)0x0008)
#define TIM_CHCTLR2_IC3F ((u16_t)0x00F0)
#define TIM_CHCTLR2_IC3F_0 ((u16_t)0x0010)
#define TIM_CHCTLR2_IC3F_1 ((u16_t)0x0020)
#define TIM_CHCTLR2_IC3F_2 ((u16_t)0x0040)
#define TIM_CHCTLR2_IC3F_3 ((u16_t)0x0080)
#define TIM_CHCTLR2_IC4PSC ((u16_t)0x0C00)
#define TIM_CHCTLR2_IC4PSC_0 ((u16_t)0x0400)
#define TIM_CHCTLR2_IC4PSC_1 ((u16_t)0x0800)
#define TIM_CHCTLR2_IC4F ((u16_t)0xF000)
#define TIM_CHCTLR2_IC4F_0 ((u16_t)0x1000)
#define TIM_CHCTLR2_IC4F_1 ((u16_t)0x2000)
#define TIM_CHCTLR2_IC4F_2 ((u16_t)0x4000)
#define TIM_CHCTLR2_IC4F_3 ((u16_t)0x8000)

#define TIM_CCER_CC1E ((u16_t)0x0001)
#define TIM_CCER_CC1P ((u16_t)0x0002)
#define TIM_CCER_CC1NE ((u16_t)0x0004)
#define TIM_CCER_CC1NP ((u16_t)0x0008)
#define TIM_CCER_CC2E ((u16_t)0x0010)
#define TIM_CCER_CC2P ((u16_t)0x0020)
#define TIM_CCER_CC2NE ((u16_t)0x0040)
#define TIM_CCER_CC2NP ((u16_t)0x0080)
#define TIM_CCER_CC3E ((u16_t)0x0100)
#define TIM_CCER_CC3P ((u16_t)0x0200)
#define TIM_CCER_CC3NE ((u16_t)0x0400)
#define TIM_CCER_CC3NP ((u16_t)0x0800)
#define TIM_CCER_CC4E ((u16_t)0x1000)
#define TIM_CCER_CC4P ((u16_t)0x2000)
#define TIM_CCER_CC4NP ((u16_t)0x8000)

#define TIM_CNT_CNT ((u16_t)0xFFFF)

#define TIM_PSC_PSC ((u16_t)0xFFFF)

#define TIM_ATRLR_ARR ((u16_t)0xFFFF)

#define TIM_RPTCR_REP ((u8_t)0xFF)

#define TIM_CH1CVR_CCR1 ((u16_t)0xFFFF)

#define TIM_CH2CVR_CCR2 ((u16_t)0xFFFF)

#define TIM_CH3CVR_CCR3 ((u16_t)0xFFFF)

#define TIM_CH4CVR_CCR4 ((u16_t)0xFFFF)

#define TIM_BDTR_DTG ((u16_t)0x00FF)
#define TIM_BDTR_DTG_0 ((u16_t)0x0001)
#define TIM_BDTR_DTG_1 ((u16_t)0x0002)
#define TIM_BDTR_DTG_2 ((u16_t)0x0004)
#define TIM_BDTR_DTG_3 ((u16_t)0x0008)
#define TIM_BDTR_DTG_4 ((u16_t)0x0010)
#define TIM_BDTR_DTG_5 ((u16_t)0x0020)
#define TIM_BDTR_DTG_6 ((u16_t)0x0040)
#define TIM_BDTR_DTG_7 ((u16_t)0x0080)
#define TIM_BDTR_LOCK ((u16_t)0x0300)
#define TIM_BDTR_LOCK_0 ((u16_t)0x0100)
#define TIM_BDTR_LOCK_1 ((u16_t)0x0200)
#define TIM_BDTR_OSSI ((u16_t)0x0400)
#define TIM_BDTR_OSSR ((u16_t)0x0800)
#define TIM_BDTR_BKE ((u16_t)0x1000)
#define TIM_BDTR_BKP ((u16_t)0x2000)
#define TIM_BDTR_AOE ((u16_t)0x4000)
#define TIM_BDTR_MOE ((u16_t)0x8000)

#define TIM_DMACFGR_DBA ((u16_t)0x001F)
#define TIM_DMACFGR_DBA_0 ((u16_t)0x0001)
#define TIM_DMACFGR_DBA_1 ((u16_t)0x0002)
#define TIM_DMACFGR_DBA_2 ((u16_t)0x0004)
#define TIM_DMACFGR_DBA_3 ((u16_t)0x0008)
#define TIM_DMACFGR_DBA_4 ((u16_t)0x0010)
#define TIM_DMACFGR_DBL ((u16_t)0x1F00)
#define TIM_DMACFGR_DBL_0 ((u16_t)0x0100)
#define TIM_DMACFGR_DBL_1 ((u16_t)0x0200)
#define TIM_DMACFGR_DBL_2 ((u16_t)0x0400)
#define TIM_DMACFGR_DBL_3 ((u16_t)0x0800)
#define TIM_DMACFGR_DBL_4 ((u16_t)0x1000)

#define TIM_DMAADR_DMAR_DMAB ((u16_t)0xFFFF)

struct ch32v003_usart
{
    volatile u16_t STATR;
    u16_t RESERVED0;
    volatile u16_t DATAR;
    u16_t RESERVED1;
    volatile u16_t BRR;
    u16_t RESERVED2;
    volatile u16_t CTLR1;
    u16_t RESERVED3;
    volatile u16_t CTLR2;
    u16_t RESERVED4;
    volatile u16_t CTLR3;
    u16_t RESERVED5;
    volatile u16_t GPR;
    u16_t RESERVED6;
};

#define USART1 ((struct ch32v003_usart*)0x40013800)

#define USART_STATR_PE ((u16_t)0x0001)
#define USART_STATR_FE ((u16_t)0x0002)
#define USART_STATR_NE ((u16_t)0x0004)
#define USART_STATR_ORE ((u16_t)0x0008)
#define USART_STATR_IDLE ((u16_t)0x0010)
#define USART_STATR_RXNE ((u16_t)0x0020)
#define USART_STATR_TC ((u16_t)0x0040)
#define USART_STATR_TXE ((u16_t)0x0080)
#define USART_STATR_LBD ((u16_t)0x0100)
#define USART_STATR_CTS ((u16_t)0x0200)

#define USART_DATAR_DR ((u16_t)0x01FF)

#define USART_BRR_DIV_F ((u16_t)0x000F)
#define USART_BRR_DIV_M ((u16_t)0xFFF0)

#define USART_CTLR1_SBK ((u16_t)0x0001)
#define USART_CTLR1_RWU ((u16_t)0x0002)
#define USART_CTLR1_RE ((u16_t)0x0004)
#define USART_CTLR1_TE ((u16_t)0x0008)
#define USART_CTLR1_IDLEIE ((u16_t)0x0010)
#define USART_CTLR1_RXNEIE ((u16_t)0x0020)
#define USART_CTLR1_TCIE ((u16_t)0x0040)
#define USART_CTLR1_TXEIE ((u16_t)0x0080)
#define USART_CTLR1_PEIE ((u16_t)0x0100)
#define USART_CTLR1_PS ((u16_t)0x0200)
#define USART_CTLR1_PCE ((u16_t)0x0400)
#define USART_CTLR1_WAKE ((u16_t)0x0800)
#define USART_CTLR1_M ((u16_t)0x1000)
#define USART_CTLR1_UE ((u16_t)0x2000)
#define USART_CTLR1_OVER8 ((u16_t)0x8000)

