rksdna/swamp-v2/ch32v003_registers.h
#define USART_CTLR2_ADD ((u16_t)0x000F)
#define USART_CTLR2_LBDL ((u16_t)0x0020)
#define USART_CTLR2_LBDIE ((u16_t)0x0040)
#define USART_CTLR2_LBCL ((u16_t)0x0100)
#define USART_CTLR2_CPHA ((u16_t)0x0200)
#define USART_CTLR2_CPOL ((u16_t)0x0400)
#define USART_CTLR2_CLKEN ((u16_t)0x0800)
#define USART_CTLR2_STOP ((u16_t)0x3000)
#define USART_CTLR2_STOP_0 ((u16_t)0x1000)
#define USART_CTLR2_STOP_1 ((u16_t)0x2000)
#define USART_CTLR2_LINEN ((u16_t)0x4000)

#define USART_CTLR3_EIE ((u16_t)0x0001)
#define USART_CTLR3_IREN ((u16_t)0x0002)
#define USART_CTLR3_IRLP ((u16_t)0x0004)
#define USART_CTLR3_HDSEL ((u16_t)0x0008)
#define USART_CTLR3_NACK ((u16_t)0x0010)
#define USART_CTLR3_SCEN ((u16_t)0x0020)
#define USART_CTLR3_DMAR ((u16_t)0x0040)
#define USART_CTLR3_DMAT ((u16_t)0x0080)
#define USART_CTLR3_RTSE ((u16_t)0x0100)
#define USART_CTLR3_CTSE ((u16_t)0x0200)
#define USART_CTLR3_CTSIE ((u16_t)0x0400)
#define USART_CTLR3_ONEBIT ((u16_t)0x0800)

#define USART_GPR_PSC ((u16_t)0x00FF)
#define USART_GPR_PSC_0 ((u16_t)0x0001)
#define USART_GPR_PSC_1 ((u16_t)0x0002)
#define USART_GPR_PSC_2 ((u16_t)0x0004)
#define USART_GPR_PSC_3 ((u16_t)0x0008)
#define USART_GPR_PSC_4 ((u16_t)0x0010)
#define USART_GPR_PSC_5 ((u16_t)0x0020)
#define USART_GPR_PSC_6 ((u16_t)0x0040)
#define USART_GPR_PSC_7 ((u16_t)0x0080)

#define USART_GPR_GT ((u16_t)0xFF00)

struct ch32v003_wwdg
{
    volatile u32_t CTLR;
    volatile u32_t CFGR;
    volatile u32_t STATR;
};

#define WWDG ((struct ch32v003_wwdg*)0x40002C00)

#define WWDG_CTLR_T ((u8_t)0x7F)
#define WWDG_CTLR_T0 ((u8_t)0x01)
#define WWDG_CTLR_T1 ((u8_t)0x02)
#define WWDG_CTLR_T2 ((u8_t)0x04)
#define WWDG_CTLR_T3 ((u8_t)0x08)
#define WWDG_CTLR_T4 ((u8_t)0x10)
#define WWDG_CTLR_T5 ((u8_t)0x20)
#define WWDG_CTLR_T6 ((u8_t)0x40)
#define WWDG_CTLR_WDGA ((u8_t)0x80)

#define WWDG_CFGR_W ((u16_t)0x007F)
#define WWDG_CFGR_W0 ((u16_t)0x0001)
#define WWDG_CFGR_W1 ((u16_t)0x0002)
#define WWDG_CFGR_W2 ((u16_t)0x0004)
#define WWDG_CFGR_W3 ((u16_t)0x0008)
#define WWDG_CFGR_W4 ((u16_t)0x0010)
#define WWDG_CFGR_W5 ((u16_t)0x0020)
#define WWDG_CFGR_W6 ((u16_t)0x0040)
#define WWDG_CFGR_WDGTB ((u16_t)0x0180)
#define WWDG_CFGR_WDGTB0 ((u16_t)0x0080)
#define WWDG_CFGR_WDGTB1 ((u16_t)0x0100)
#define WWDG_CFGR_EWI ((u16_t)0x0200)

#define WWDG_STATR_EWIF ((u8_t)0x01)

struct ch32v003_exten
{
    volatile u32_t CTR;
};

#define EXTEN ((struct ch32v003_exten*)0x40023800)

#define EXTEN_CTR_LOCKUP_EN ((u32_t)0x00000040)
#define EXTEN_CTR_LOCKUP_RSTF ((u32_t)0x00000080)
#define EXTEN_CTR_LDO_TRIM ((u32_t)0x00000400)
#define EXTEN_CTR_OPA_EN ((u32_t)0x00010000)
#define EXTEN_CTR_OPA_NSEL ((u32_t)0x00020000)
#define EXTEN_CTR_OPA_PSEL ((u32_t)0x00040000)

struct ch32v003_esig
{
    volatile u32_t FLACAP;
    u32_t RESERVED;
    volatile u32_t UNIID1;
    volatile u32_t UNIID2;
    volatile u32_t UNIID3;
};

#define ESIG ((struct ch32v003_esig*)0x1FFFF7E0)

#define ESIG_FLACAP_FSIZE ((u32_t)0x0000FFFF)

#define ESIG_FUNIID1_UID ((u32_t)0xFFFFFFFF)

#define ESIG_FUNIID2_UID ((u32_t)0xFFFFFFFF)

#define ESIG_FUNIID3_UID ((u32_t)0xFFFFFFFF)

#endif
